{
  "id": "apple_finance_business_partner_london",
  "title": "Finance Business Partner - Demand Forecasting and Analysis",
  "location": "London, England, United Kingdom",
  "company": "Apple",
  "seniority": "Mid-level",
  "responsibilities": [
    "Prepare country product forecasts in collaboration with sales teams.",
    "Perform variance analysis of performance including insight from local markets.",
    "Understand drivers of short and long-term performance.",
    "Identify risk and opportunity to demand.",
    "Present and discuss findings in Leadership reviews.",
    "Analyse key business trends.",
    "Monitor consumer offers live in the market.",
    "Provide insights into performance within products, countries and channel partners."
  ],
  "must_have_requirements": [
    "Excellent communication and influencing skills.",
    "Proven Excel experience, comfortable to work with large data sets to visualise findings.",
    "Proficient in spoken and written English.",
    "Highly analytical, with ability to offer solutions based recommendations.",
    "Strong presenting skills."
  ],
  "nice_to_have_requirements": [
    "Innovative team based player, with forward-thinking approach that strives for operational improvements.",
    "Knowledge of SQL/Tableau/Keynote.",
    "Able to act independently and be self-motivated.",
    "Ability to see big picture whilst simultaneously zooming into the details."
  ],
  "skills": [
    {
      "name": "Communication",
      "importance": 9,
      "years_of_experience": 0
    },
    {
      "name": "Excel",
      "importance": 8,
      "years_of_experience": 3
    },
    {
      "name": "Data Analysis",
      "importance": 8,
      "years_of_experience": 0
    },
    {
      "name": "Presenting",
      "importance": 7,
      "years_of_experience": 3
    },
    {
      "name": "SQL",
      "importance": 5,
      "years_of_experience": 0
    },
    {
      "name": "Tableau",
      "importance": 5,
      "years_of_experience": 0
    },
    {
      "name": "Keynote",
      "importance": 5,
      "years_of_experience": 0
    }
  ],
  "tech_stack": [
    "Excel",
    "SQL",
    "Tableau",
    "Keynote"
  ],
  "years_of_experience_min": 0,
  "years_of_experience_max": 0,
  "raw_text": "Finance Business Partner - Demand Forecasting and Analysis\nLondon, England, United Kingdom\nCorporate Functions\nSummary\nPosted:\n19 Nov 2025\nWeekly Hours:\n35\nRole Number:\n200630686-2114\nApple is a place where extraordinary people gather to do their best work. Together we create products and experiences people once couldn’t have imagined - and now can’t imagine living without. If you’re motivated by the idea of making a real impact, and joining a team where we pride ourselves in being one of the most diverse and inclusive companies in the world, a career with Apple might be your dream job! You will become a member of the Sales Finance team at Apple. With approximately 150 employees based across 12 locational hubs within EMEIA (Europe, Middle East, India and Africa), we bring value, collaborating with many teams to provide outstanding commercial and financial support. We set the bar high; go out of our way to help others; share knowledge; filter out noise to focus on the essential; encourage the very best from ourselves and the team; and drive the right course of action. To do all of this you will be an excellent communicator, collaborator and innovator, with a passion for debate and inclusion. The purpose of this role is to provide timely and accurate forecasts with insights on demand, enabling effective decision making.\n\nDescription\nYou will have responsibility for preparing country product forecasts, in close collaboration with sales teams, for the current and upcoming quarters. Core tasks will involve variance analysis of performance including insight from local markets; understanding drivers of short and long-term performance; identifying risk and opportunity to demand and presenting and discussing these in Leadership reviews . Great communication and commercial acumen will be important to analyse key business trends; monitor consumer offers live in the market; and provide insights into performance within products, countries and channel partners.\n\nMinimum Qualifications\nExcellent communication and influencing skills are crucial.\nProven Excel experience, comfortable to work with large data sets to visualise findings.\nProficient in spoken and written English, with another language an advantage.\nHighly analytical, with ability to offer solutions based recommendations.\nStrong presenting skills, being able to tell your story in a structured way and have valuable discussions with leadership.\nPreferred Qualifications\nInnovative team based player, with forward-thinking approach that strives for operational improvements.\nKnowledge of SQL/Tableau/Keynote is an advantage.\nAble to act independently and be self-motivated.\nAbility to see big picture whilst simultaneously zooming into the details.\n\nAt Apple, we’re not all the same. And that’s our greatest strength. We draw on the differences in who we are, what we’ve experienced and how we think. Because to create products that serve everyone, we believe in including everyone. Therefore, we are committed to treating all applicants fairly and equally. As a registered Disability Confident employer, we will work with applicants to make any reasonable accommodations. Apple will consider for employment all qualified applicants with criminal backgrounds in a manner consistent with applicable law. Learn more\n\nSubmit CV"
}
