{
  "job_id": "R-73361",
  "company": "Nike",
  "role": "Night Operations Assistant (Athlete)",
  "location": "London",
  "seniority": "Mid-level",
  "responsibilities": [
    "Focus on stock, processes and delivery efficiency.",
    "Ensure all goods are received and processed accurately.",
    "Process stock efficiently.",
    "Serve and deliver a premium brand experience to consumers.",
    "Assist retail leads and floor managers in training new employees.",
    "Support various store departments (e.g. operate cash register, manage incoming and outgoing goods, refill products on shopfloor, build visual displays).",
    "Recommend appropriate products to reach sales targets.",
    "Use knowledge for digital devices to create a bond between online and offline sales or services in the store.",
    "Inform consumers and new teammates about the Nike products and services.",
    "Improve knowledge via tools and training courses to stay up to date and to seek for more insights on sales trends, Nike products, services, and culture."
  ],
  "must_have_requirements": [
    "Flexible with scheduling and available to work retail hours, which may include day, evening, weekends, and/or holidays, based on department and store/company needs.",
    "Must be available to work evenings and available Saturday & Sunday",
    "6/7 Nights full availability shift patterns will be at maximum 5/7 working days."
  ],
  "nice_to_have_requirements": [
    "Customer service and/or retail experience."
  ],
  "skills": [
    {
      "skill": "Customer Service",
      "importance": 7
    },
    {
      "skill": "Retail",
      "importance": 5
    },
    {
      "skill": "Communication",
      "importance": 7
    },
    {
      "skill": "Brand Ambassadorship",
      "importance": 6
    },
    {
      "skill": "Collaboration",
      "importance": 7
    },
    {
      "skill": "Sales Techniques",
      "importance": 6
    },
    {
      "skill": "Digital Devices",
      "importance": 5
    }
  ],
  "tech_stack": [],
  "years_of_experience": {
    "customer_service": 0,
    "retail": 0
  },
  "experience_summary": {
    "years_minimum": 0,
    "years_maximum": 0
  },
  "raw_text": "Night Operations Assistant (Athlete) - 40h - NIKE OXFORD CIRCUS\n\nPosition Type\nPart Time\n\nCareer area\nRetail Stores\n\nLocation\n253-259 Regent St., Oxford Street, London W1R1AB, United Kingdom\n\nJob ID\nR-73361\n\nNike Oxford Circus is looking for the next Full Time 40 hours Night Operations Athlete\nto join our team and provide world-class\nservice to the consumer:\n\nAs our Night Operations Athlete your role is crucial to the effective running of the store. You will focus on our stock, processes & delivery efficiency, ensuring all goods are received and processed accurately.\n\nYou will process stock efficiently to ensure that the back of house environment mirrors the unique energy, passion and innovation our consumers experience on the shop floor.\n\nWhat you bring:\n\nUsing your expertise in the field of exceptional consumer service and product knowledge to serve and deliver a premium brand experience to our consumers.\nAssisting our retail leads and floor managers (Coaches) in training new employees\nSupporting various store departments (e.g. operate cash register, manage incoming and outgoing goods, refill products on shopfloor, build visual displays) and recommending appropriate products to reach sales targets.\nUsing your knowledge for digital devices to create a bond between online and offline sales or services in the store.\nInforming consumers and new teammates about the NIKE products and services\nImproving your own knowledge via our tools and training courses to stay up to date and to seek for more insights on sales trends, NIKE products, services, and culture\n\n\nWhat you get:\n\nOne of the best compensation and benefits packages in the industry\nOpportunity for monthly performance-based bonus\nA supportive team that values Diversity, Equity & Inclusion\nA career at a company at the forefront of the sports and fashion industry\nGenerous online and in-store employee discounts and a brand-new NIKE outfit for you to sport with your teammates on the sales floor.\n\nQualifications\n\nCustomer service and/or retail experience preferred.\nEffective communicator, brand ambassador, and collaborative teammate\nDemonstrated ability to apply product sales techniques.\nFlexible with scheduling and available to work retail hours, which may include day, evening, weekends, and/or holidays, based on department and store/company needs.\n\nAvailability\n\n6/7 Nights full availability shift patterns will be at maximum 5/7 working days.\nMust be available to work evenings and available Saturday & Sunday\n\nApply now online (it is recommended that you indicate your availability in your resume!).\n\nWe are waiting for you!",
  "id": "nike_night_operations_assistant_(athlete)_london"
}
