{
  "job_id": "tui_destination_services_sales_rep_punta_cana",
  "company": "TUI",
  "role": "Destination Services Sales Rep",
  "location": "Punta Cana, DOM",
  "seniority": "Mid-level",
  "responsibilities": [
    "Meet, coordinate, advise, sell, and fix complex problems for guests.",
    "Assist guests with online products and services.",
    "Uncover guests' holiday needs and match them with appropriate service solutions and sales opportunities.",
    "Monitor and celebrate sales target achievements and guest feedback results.",
    "Represent the company in Destination Services uniform."
  ],
  "must_have_requirements": [
    "Right to work in Dominican Republic.",
    "Fully conversational in English.",
    "Valid driving license and a car."
  ],
  "nice_to_have_requirements": [],
  "skills": [
    {
      "name": "Sales",
      "importance": 8,
      "years_of_experience": 0
    },
    {
      "name": "Communication",
      "importance": 9,
      "years_of_experience": 0
    },
    {
      "name": "Customer Service",
      "importance": 10,
      "years_of_experience": 0
    },
    {
      "name": "Problem Solving",
      "importance": 8,
      "years_of_experience": 0
    },
    {
      "name": "Teamwork",
      "importance": 7,
      "years_of_experience": 0
    }
  ],
  "tech_stack": [
    "iPad"
  ],
  "summary_of_experience": {
    "years_minimum": 0,
    "years_maximum": 0,
    "required_education": null
  },
  "raw_text": "Destination Services Sales Rep | Local Residents\n\nPunta Cana, DOM\nOnsite\nLocally employed contract\nFull Time\nSummer 26\n135614\n\nThis job offers a local Dominican contract and to apply you should have residency in Dominican Republic.\n\nWe are seeking digital experienced and helpful individuals like you to join our diverse team of Sales Reps. If you have the right to work in Dominican Republic and speak English, then keep on reading!  \n\nABOUT OUR OFFER\nA job in Service at TUI offers more than your basic salary which already starts from 335,8566.00 DOP gross/month, and your earned commission on top.\nDepending on your role commission earning will come on top. Avarage commission potential from $1,500 USD per month. The more you sell, the more you earn.\nA company iPad & uniform are of course standard.\nWork week of 40 hours with 2 days off.\n14 days of holidays after the first year worked ´we give you two extra days (on your Birthday and one Happy day)\nWe pay you for all training days completed plus free access to our TUI Learning Hub, TUI Skills Academy & language lessons.\nGet involved with charity and sustainability initiatives like the TUI Care Foundation and complimentary access to our dedicated WeCare Team & 24/7 Wellbeing Hub.\nWe offer permanent or seasonal contracts, but either way you can level up your career with growth opportunities tailored to your unique skills and expertise.\nABOUT THE JOB\nYou could be meeting, coordinating, advising, selling, and/or fixing more complex problems.\nYou will be assisting any traditional guests with our online products & services.\nIt all starts with you uncovering guests holiday needs and matching them with the right service solution and/or sales opportunities.\nYou will be able to monitor and celebrate your success with regular sales target updates and guest feedback results for service provided at the airport, service in your hotels and how well you have ‘solved on the spot’.\nYou will learn more about all TUI Destination Team job roles as we identify and match your skills to the most suitable jobs throughout your recruitment experience.\nABOUT YOU\nA consistently happy colleague and great team player.\nA true people person - confident communicating and/or selling to international guests whilst remaining calm and empathic in a crisis or when problems for our guests occur.\nWilling to learn the demands of the job, the technology needed to do it and all about our incredible products & services.\nYou are fully conversational in English.\nA valid driving license and a car is required.\nFinally … you will be proud to wear your Destination Services uniform and represent us finelly at all times.\n\ndestination.careers@tui.com\n\nPlease note: For enquiries only. Applications are only accepted online."
}
