{
  "jobId": "apple_technical_project_manager_london",
  "company": "Apple",
  "role": "Technical Project Manager",
  "location": "London, England, United Kingdom",
  "seniority": "Mid-level",
  "responsibilities": [
    "Formulate and coordinate requirements and onboarding plans, including scope and solution definition.",
    "Support existing partners with issue identification and resolution.",
    "Provide technical support to external partner development teams implementing iOS and Wallet technologies.",
    "Understand Apple and industry standards to drive Wallet adoption by solving customer problems.",
    "Manage communication and status updates within the core team and external partner engagement teams.",
    "Collaborate with Product/Engineering, government agencies, payment networks, and integrators to resolve issues.",
    "Participate in external meetings to evaluate partner capabilities and risks, ensuring risk mitigation.",
    "Create and deliver high-quality content to external partners, communicating product features and technical requirements.",
    "Research and understand industry standards for identity across multiple EMEA regions.",
    "Prioritise multiple partner interactions from initiation to completion, providing consistent updates to senior management."
  ],
  "mustHaveRequirements": [
    "Technical proficiency",
    "Excellent communication skills with project and partner management experience",
    "Direct experience working with external partners on cross-channel initiatives and new technologies",
    "Experience or knowledge of API technologies and delivery of products or services based on APIs",
    "Experience developing iOS solutions and knowledge of broader App technologies and platforms"
  ],
  "niceToHaveRequirements": [
    "Experience implementing iOS APIs",
    "Good understanding of RF technologies",
    "NFC technology expertise",
    "Understanding of network tokenisation standards, NFC and EMV contactless, 3-D Secure rails and mobile applications",
    "Degree education in relevant field"
  ],
  "skills": [
    {
      "name": "Project Management",
      "importance": 9,
      "yearsOfExperience": 3
    },
    {
      "name": "Partner Management",
      "importance": 9,
      "yearsOfExperience": 3
    },
    {
      "name": "API",
      "importance": 7,
      "yearsOfExperience": 1
    },
    {
      "name": "iOS",
      "importance": 7,
      "yearsOfExperience": 3
    },
    {
      "name": "NFC",
      "importance": 5,
      "yearsOfExperience": 0
    },
    {
      "name": "EMV",
      "importance": 3,
      "yearsOfExperience": 0
    },
    {
      "name": "Communication",
      "importance": 10,
      "yearsOfExperience": 3
    },
    {
      "name": "RF Technologies",
      "importance": 4,
      "yearsOfExperience": 0
    }
  ],
  "techStack": [
    "iOS",
    "API",
    "NFC",
    "EMV"
  ],
  "summaryOfExperience": {
    "yearsOfExperienceRequired": 0,
    "managementExperienceRequired": 0,
    "techLeadExperienceRequired": 0
  },
  "rawText": "Technical Project Manager, Apple Wallet, Payments and Commerce\nLondon, England, United Kingdom\nSoftware and Services\nSummary\nPosted:\n14 Nov 2025\nWeekly Hours:\n35\nRole Number:\n200632239-2114\nThe Wallet, Payments and Commerce team is seeking a Technical Project Manager to support partners develop and implement features and functionality leveraging a range of Apple Wallet services. This is a role that works cross functionally with Business Development leads, Apple Pay Engineering, Operations and Product Marketing. As well as with Payment Networks, acquirers, issuers, integrators, iOS developers and software/hardware vendors to help define and deliver a wide variety of Wallet solutions.\nDescription\nWe're seeking a “hybrid” product/project professional to provide key Subject Matter Expertise to partners leveraging Wallet technologies. The candidate will create and present content about complex technologies to business and technical audiences. Experience in, digital credentials, identity, payment processing, mobile payments, electronic commerce, NFC ecosystem and applications is beneficial. \n\nResponsibilities\nHelp formulate and coordinate the requirements and onboarding plans including identifying scope, solution definition for physical terminals or in app payment architecture, testing plans and post launch operational processes.\nSupport existing partners with issue identification and resolution.\nProvide technical support to external partner development teams as they work on implementing solutions leveraging iOS and Wallet technologies.\nUnderstand Apple and industry standards and technology to identify and drive Wallet adoption through solving customer problems.\nHandle communication or progress/status within core team and external partner engagement teams; raise issues as needed.\nWork closely with Product/Engineering, government agencies, payment networks, processors, integrators to resolve issues that arise during solution definition or implementation.\nParticipate in external meetings to understand and evaluate partner capabilities and risks. Ensure risks are identified and mitigated.\nCreate and deliver high quality content to external partners communicating high level product features and functionality as well as detailed technical integration requirements.\nResearch and understand industry standards for identity across multiple EMEA regions.\nPrioritise multiple partner interactions from initiation to completion while providing consistent updates and communication to senior management will guide success in this role.\nMinimum Qualifications\nTechnical proficiency.\nExcellent communicator with successful project and partner management experience.\nDirect experience working with external partners on cross channel initiatives and new technologies.\nExperience or knowledge of API technologies and delivery of products or services based on APIs will be required.\nExperience developing iOS solutions as well as knowledge of broader App technologies and platforms.\nPreferred Qualifications\nExperience implementing iOS APIs.\nAdditionally, a good understanding of RF technologies will be beneficial.\nNFC technology expertise.\nUnderstanding of network tokenisation standards, NFC and EMV contactless, 3-D Secure rails and mobile applications is beneficial.\nDegree education in relevant field desirable but candidates from all education backgrounds are encouraged to apply"
}
