{
  "job_id": "converse_retail_associate_serravalle",
  "company": "Converse",
  "role": "Retail Associate",
  "location": "Serravalle, Alessandria, Italy",
  "seniority": "Mid-level",
  "responsibilities": [
    "Provide exceptional customer service and product knowledge to deliver a premium brand experience.",
    "Assist leads in training new employees.",
    "Support various store departments, including cash management, receiving, restocking, and display setup.",
    "Advise customers on suitable products to achieve sales targets.",
    "Use digital device knowledge to connect online and offline sales and services.",
    "Inform customers and colleagues about Converse products and services.",
    "Enhance knowledge through training tools to stay updated on sales trends, products, services, and Converse culture."
  ],
  "must_have_requirements": [],
  "nice_to_have_requirements": [
    "Previous retail experience is an advantage."
  ],
  "skills": [
    {
      "name": "Customer Service",
      "importance": 9
    },
    {
      "name": "Sales",
      "importance": 8
    },
    {
      "name": "Teamwork",
      "importance": 7
    },
    {
      "name": "Communication",
      "importance": 7
    },
    {
      "name": "Digital Literacy",
      "importance": 5
    },
    {
      "name": "Training",
      "importance": 4
    }
  ],
  "tech_stack": [],
  "years_of_experience_required": 0,
  "years_of_experience_preferred": 0,
  "summary_minimum_experience": 0,
  "summary_maximum_experience": 0,
  "raw_text": "Retail Associate II\nVia Della Moda 1, Serravalle, Alessandria 15069, Italy\n\nBecome part of the Converse Team\n\nConverse is a place to explore potential, break barriers and push out the edges of what can be. The company looks for people who can grow, think, dream and create. Its culture thrives by embracing diversity and rewarding imagination. The brand seeks achievers, leaders and visionaries. At Converse, it’s about each person bringing skills and passion to a challenging and constantly evolving world to make things better as a team.\n\nAddetto vendite - 30 hours\n\nUnisciti al team Converse!\n\nPer essere un nostro Sales Assistant ti deve piacere: \n\navvalerti della tua esperienza nel campo di un'assistenza clienti e una conoscenza dei prodotti eccezionali per offrire un'esperienza del marchio di prima qualità ai nostri clienti\n\nassistere i nostri Lead nella formazione dei nuovi dipendenti\n\nsostenere i vari reparti del punto vendita (ad es. gestione delle casse e delle merci in entrata e uscita, rifornimento dei prodotti nel punto vendita, allestimento di espositori) e consigliare i prodotti adeguati al raggiungimento degli obiettivi di vendita\n\nusare le tue conoscenze relative ai dispositivi digitali per creare un legame tra vendite e servizi online e offline nel punto vendita\n\ninformare i clienti e i nuovi colleghi su prodotti e servizi CONVERSE\n\nmigliorare le tue conoscenze tramite i nostri strumenti e i nostri corsi di formazione per garantirti un aggiornamento costante e l'apprendimento di nuove informazioni su tendenze di vendita, prodotti, servizi e cultura CONVERSE.\n\nCiò che ottieni:\n\nstipendio vantaggioso che si sviluppa in base al mercato e all'esperienza\n\nopportunità di bonus mensili \n\nsconti vantaggiosi per dipendenti da usare online e nel punto vendita\n\nopportunità di sviluppo e carriera entusiasmanti\n\nformazione continua su vendite e prodotti\n\nambiente dinamico e ricco di motivazione con bassa gerarchizzazione e che valuta positivamente diversità, equità e inclusione (DE&I)\n\nabbigliamento del personale pensato per rappresentare CONVERSE e promuovere il nostro spirito di squadra\n\nIl tuo contributo:\n\npassione per CONVERSE\n\nla pregressa esperienza nel settore retail rappresenta un vantaggio\n\ncapacità di usare un linguaggio professionale\n\nforte concentrazione sul cliente\n\ncapacità di lavorare in un team\n\nproattività, apertura mentale, motivazione\n\nflessibilità di lavorare a turni e nei weekend\n\nAbbiamo suscitato il tuo interesse? Candidati subito, online e con semplicità. Ti aspettiamo!"
}
