{
  "job_id": "astonmartin_programme_coordinator_gaydon",
  "company": "Aston Martin",
  "role": "Programme Coordinator",
  "location": "Gaydon, Warwickshire",
  "seniority": "Senior",
  "responsibilities": [
    "Coordinate Procurement activities across multiple vehicle programmes.",
    "Lead cross-functional reviews to support sourcing, cost, and timing delivery.",
    "Manage and facilitate Programme Sourcing Councils.",
    "Collaborate with cross-functional teams to track progress, highlight risks, and keep milestones on plan.",
    "Develop and improve Procurement processes.",
    "Provide analysis and reporting on material and investment costs.",
    "Support the development of commodity strategies.",
    "Contribute to continuous-improvement initiatives.",
    "Support reporting and data improvement projects.",
    "Guide and mentor junior team members."
  ],
  "must_have_requirements": [
    "Experience in Procurement and/or Programme Management.",
    "Strong organisational, analytical and communication skills.",
    "Attention to detail.",
    "Understanding of the strategic importance of Procurement.",
    "Degree or equivalent experience.",
    "Strong Excel capability.",
    "Passion for continuous improvement."
  ],
  "nice_to_have_requirements": [
    "Power Query or VBA skills are an advantage.",
    "Experience in automotive industry beneficial."
  ],
  "skills": [
    {
      "name": "Procurement",
      "importance": 8,
      "years_of_experience": 3
    },
    {
      "name": "Programme Management",
      "importance": 8,
      "years_of_experience": 3
    },
    {
      "name": "Microsoft Excel",
      "importance": 9,
      "years_of_experience": 0
    },
    {
      "name": "Power Query",
      "importance": 5,
      "years_of_experience": 0
    },
    {
      "name": "VBA",
      "importance": 5,
      "years_of_experience": 0
    },
    {
      "name": "Supply Chain",
      "importance": 5,
      "years_of_experience": 1
    },
    {
      "name": "Project Coordination",
      "importance": 5,
      "years_of_experience": 1
    },
    {
      "name": "Communication Skills",
      "importance": 8,
      "years_of_experience": 0
    },
    {
      "name": "Analytical Skills",
      "importance": 8,
      "years_of_experience": 0
    },
    {
      "name": "Organisational Skills",
      "importance": 8,
      "years_of_experience": 0
    }
  ],
  "tech_stack": [
    "Microsoft Excel",
    "Power Query",
    "VBA"
  ],
  "experience_summary": {
    "years_minimum": 0,
    "years_maximum": 0
  },
  "raw_text": "SENIOR PROCUREMENT PROGRAMME COORDINATOR\n\nJob no: 511714\nWork type: Full Time - Fixed Term Contract\nLocation: Gaydon, Warwickshire\nCategories: Procurement\n\nAt Aston Martin, every car tells a story of precision, performance, and passion. Behind each masterpiece is a world-class team working in harmony to deliver excellence — and we’re looking for a Senior Programme Coordinator to join that journey on a 12-month fixed term contract.\n\nThe Role\n\nAs a Senior Programme Coordinator, you’ll play a vital role in connecting our Procurement and Vehicle Programme teams. You’ll be the focal point for coordination, metrics, and control across all Procurement activities that support our new vehicle programmes. From managing sourcing councils to driving cross-functional reviews, your influence will ensure that every component is sourced to the right quality, at the best cost, and on time.\n\nYou’ll take ownership of programme-level reporting and supplier engagement, guiding our teams to meet key milestones. This is a role where precision meets creativity — one that combines analytical skill with collaboration, and process excellence with passion for automotive innovation.\n\nWhat You’ll Do\n\nCoordinate Procurement activities across multiple vehicle programmes, ensuring all milestones are achieved.\nLead cross-functional reviews to support sourcing, cost, and timing delivery.\nManage and facilitate Programme Sourcing Councils to ensure on-time, on-budget sourcing decisions.\nCollaborate with cross-functional teams across multiple programmes to track progress, highlight risks, and keep milestones on plan.\nDevelop and improve Procurement processes to enhance efficiency and performance.\nProvide analysis and reporting on material and investment costs, identifying risks and opportunities.\nSupport the development of commodity strategies, including low-cost sourcing initiatives.\nContribute to continuous-improvement initiatives that enhance reporting accuracy and reduce manual effort.\nSupport reporting and data improvement projects, using Excel and Power Query to automate or simplify processes.\nGuide and mentor junior team members to deliver against key programme gateways.\n\nWhat You’ll Bring\n\nYou’ll have experience in Procurement and/or Programme Management, with strong organisational, analytical and communication skills with attention to detail. You’ll understand the strategic importance of Procurement within a business and have the confidence to collaborate, challenge, and drive results. A degree or equivalent experience is required, alongside strong Excel capability and a passion for continuous improvement.\n\nConfident use of Microsoft Excel (Power Query or VBA skills are an advantage) or willingness to learn.\nExperience in procurement, supply chain, or project coordination (automotive experience beneficial).\nA proactive, improvement-focused mindset - curious, adaptable, and eager to streamline how things get done.\n\nAdvertised: 27 Oct 2025 GMT Standard Time\nApplications close: 27 Nov 2025 GMT Standard Time"
}
