{
  "job_id": "apple_originals_creative_executive_london",
  "company": "Apple",
  "role": "Originals Creative Executive",
  "location": "London, England, United Kingdom",
  "seniority": "Senior",
  "responsibilities": [
    "Source and assess scripts, pitches and other underlying intellectual property for Apple series potential.",
    "Guide producers and writers in the development of story and scripts.",
    "Meet with agents and key talent to identify potential projects.",
    "Run all creative aspects of development, casting, production and post-production.",
    "Maintain a close working relationship editorially with the Creative Director, Europe worldwide video.",
    "Attend script review meetings and helping with drafts.",
    "Research books and providing notes where appropriate on IP.",
    "Develop a compelling slate of shows that resonate in market and travel globally."
  ],
  "must_have_requirements": [
    "Industry thought leader within the creative community in the UK",
    "Extensive experience in scripted series development",
    "Proven pedigree in developing commissioning and delivering successful drama series’ for mainstream broadcasters and/or streamers",
    "Consistent track record of championing multiple projects from script to production",
    "Extensive work experience in script editing, development, and ideally some exec producing experience",
    "Credible and capable of offering creative input through production and in edit",
    "Strong and relevant network with premium talent (producers, writers and directors) in the UK and US"
  ],
  "nice_to_have_requirements": [
    "Deep understanding of the global content landscape, particularly the SVODs",
    "Strong interpersonal skills and an understanding of how to collaborate closely with high end talent",
    "Team-player, able to handle a myriad of responsibilities across a diverse slate of projects",
    "Can-do thinker who is able to prioritise, pivot when necessary, and exercise initiative and good judgement"
  ],
  "skills": [
    {
      "skill": "Script Development",
      "importance": 9,
      "years_of_experience": 3
    },
    {
      "skill": "Script Editing",
      "importance": 9,
      "years_of_experience": 3
    },
    {
      "skill": "Production",
      "importance": 8,
      "years_of_experience": 3
    },
    {
      "skill": "Post-Production",
      "importance": 7,
      "years_of_experience": 0
    },
    {
      "skill": "Creative Direction",
      "importance": 7,
      "years_of_experience": 0
    },
    {
      "skill": "Networking",
      "importance": 8,
      "years_of_experience": 3
    },
    {
      "skill": "Communication",
      "importance": 7,
      "years_of_experience": 0
    },
    {
      "skill": "Prioritisation",
      "importance": 6,
      "years_of_experience": 0
    }
  ],
  "tech_stack": [],
  "min_years_experience": 3,
  "max_years_experience": 0,
  "raw_text": "Apple Originals Creative Executive, Apple TV\nLondon, England, United Kingdom\nMarketing\n\nSummary\nPosted:\n21 Nov 2025\nWeekly Hours:\n35\nRole Number:\n200628717-2114\nAn Apple Originals Creative Executive has the ability to procure and identify exciting new material in the premium television space, provide creative guidance to producers and talent in the development of these shows, and be able to oversee these projects through production and post production. \nDescription\nThis is an exciting opportunity to join a small specialist creative team who work on premium content with global appeal and reach. You’ll be working with A list talent on screen and off, growing a slate of exciting new drama. You will be part of the powerhouse of our development effort in the region. You’ll be responsible for working with writers to get scripts to green light stage. You’ll also provide creative guidance to producers and talent in the development of these shows, and be able to oversee these projects through production and post production. You will constantly be building a network of talent relationships and spotting the next big trends in global scripted TV within the UK.\nResponsibilities\nSource and assess scripts, pitches and other underlying intellectual property for Apple series potential.\nGuide producers and writers in the development of story and scripts.\nMeetings with agents and key talent to identify potential projects.\nRun all creative aspects of development, casting, production and post-production.\nClose working relationship editorially with Creative Director, Europe worldwide video.\nAttending script review meetings and helping with drafts.\nResearching books and providing notes where appropriate on IP.\nDeveloping a compelling slate of shows that resonate in market and travel globally.\nMinimum Qualifications\nYou will be considered an industry thought leader within the creative community in the UK\nYou will have extensive experience in scripted series development\nProven pedigree in developing commissioning and delivering successful drama series’ for mainstream broadcasters and/or streamers\nA consistent track record of championing multiple projects from script to production\nExtensive work experience in script editing, development is a must as well as ideally some exec producing experience\nYou will need to be credible and capable of offering creative input through production and in edit\nA strong and relevant network with premium talent (producers, writers and directors) in the UK and US\nPreferred Qualifications\nYou’ll have a deep understanding of the global content landscape, particularly the SVODs\nStrong interpersonal skills and an understanding of how to collaborate closely with high end talent\nWe need a team-player, able to handle a myriad of responsibilities across a diverse slate of projects\nThis is a demanding, dynamic and high-volume position that requires a can-do thinker who is able to prioritize, pivot when necessary, and exercise initiative and good judgement."
}
