{
  "job_id": "apple_development_manager_london",
  "company": "Apple",
  "location": "London, England, United Kingdom",
  "title": "Development Manager",
  "summary": "In Places RE&D, we don’t sit back and let things happen, we make things happen, and we do this in service to all Apple employees and customers. Our team is a diverse and nimble group that manages Apple’s corporate and retail workplaces and workplace services. We develop and manage Apple’s global real estate portfolio, lead all related capital construction projects, provide outstanding facilities and site services, develop and lead sustainability initiatives to reduce the environmental impact of all Apple facilities, including commute and renewable energy programs, and do everything we can to ensure the health and safety of all Apple personnel, facilities, and customers in our facilities around the world.",
  "description": "The EMEIA Development team is responsible for the execution of the retail development strategy across the region.\nThe Development Manager is responsible for the delivery of New Store Openings, refreshes, critical MEP replacement projects, programs, etc. from concept to close out.",
  "seniority": "Mid-level",
  "responsibilities": [
    "Ensure projects are set up properly with best practice processes and systems.",
    "Handle projectʼs schedule, budget, quality, safety, and facilities turnover.",
    "Drive functional and operational excellence of all projects and programs.",
    "Assist with the creation off project Proforma, budget and schedule.",
    "Manage relationships and appoint external partners and contracts.",
    "Review lease terms and collaborate with leasing manager.",
    "Engage and maintain positive working relationships with local government jurisdictions/departments, works council, etc.",
    "Manage commissioning agents and development of sequence of operations.",
    "Manage the closeout process, warranty, construction defects and design errors and omissions.",
    "Turnover of the project or program to the facilities team.",
    "Engage general contractors, consultants, and vendors including competitive bidding and negotiation.",
    "Review all proposals, and change order requests from suppliers, consultants, general contractors and subcontracts.",
    "Prepare and present comparative analysis."
  ],
  "must_have_requirements": [
    "Construction/project management experience with a demonstrated focus in delivering outstanding retail stores or workplaces internationally.",
    "Experience in large developments such as retail store expansions, campuses, and other hyper scale construction.",
    "Expertise in the planning, scheduling, budgeting, resourcing, and executing of all technical services required to maintain and improve a large real estate portfolio.",
    "Proven ability to collaborate with internal and external partners to meet deadlines and project schedule.",
    "Ability to balance the trade-offs between operational risk and investment.",
    "Excellent leadership, communication (keynote), and supervisory skills.",
    "Ability to develop cost estimates, cash flows, schedules, and analyze Total Cost of Ownership (TCO) and Whole Life Cycle costs.",
    "Experience building and maintaining relationships with facility operation teams, utility companies, government agencies, architectural & design firms, and general contracting firms.",
    "Minimum 50% travel required."
  ],
  "nice_to_have_requirements": [
    "Bachelor's Degree in Mechanical, Electrical, Industrial, Civil, Architectural and Construction Management preferred.",
    "Strong background in data center/commercial/industrial construction to include mechanical, electrical, process piping, plumbing building systems, tenant improvement with bespoke architectural finishes, site work and ground up construction.",
    "Very proactive, responsive, and upbeat with strong organisational skills.",
    "Demonstrated success in running multiple projects, priorities, and people concurrently in a fast-paced, high growth, and results driven environment."
  ],
  "skills": [
    {
      "name": "Construction Management",
      "importance": 9,
      "years_of_experience": 3
    },
    {
      "name": "Project Management",
      "importance": 9,
      "years_of_experience": 3
    },
    {
      "name": "Budgeting",
      "importance": 7,
      "years_of_experience": 0
    },
    {
      "name": "Scheduling",
      "importance": 7,
      "years_of_experience": 0
    },
    {
      "name": "Leadership",
      "importance": 8,
      "years_of_experience": 0
    },
    {
      "name": "Communication",
      "importance": 8,
      "years_of_experience": 0
    },
    {
      "name": "Stakeholder Management",
      "importance": 7,
      "years_of_experience": 0
    },
    {
      "name": "Negotiation",
      "importance": 6,
      "years_of_experience": 0
    },
    {
      "name": "Cost Estimation",
      "importance": 7,
      "years_of_experience": 0
    },
    {
      "name": "Cash Flow Analysis",
      "importance": 6,
      "years_of_experience": 0
    },
    {
      "name": "Contract Management",
      "importance": 7,
      "years_of_experience": 0
    },
    {
      "name": "Mechanical Engineering",
      "importance": 5,
      "years_of_experience": 0
    },
    {
      "name": "Electrical Engineering",
      "importance": 5,
      "years_of_experience": 0
    },
    {
      "name": "Civil Engineering",
      "importance": 5,
      "years_of_experience": 0
    },
    {
      "name": "Architectural Design",
      "importance": 5,
      "years_of_experience": 0
    }
  ],
  "tech_stack": [],
  "min_years_experience": 0,
  "max_years_experience": 0,
  "raw_text": "Development Manager\nLondon, England, United Kingdom\nCorporate Functions\n\nSummary\nIn Places RE&D, we don’t sit back and let things happen, we make things happen, and we do this in service to all Apple employees and customers. Our team is a diverse and nimble group that manages Apple’s corporate and retail workplaces and workplace services. We develop and manage Apple’s global real estate portfolio, lead all related capital construction projects, provide outstanding facilities and site services, develop and lead sustainability initiatives to reduce the environmental impact of all Apple facilities, including commute and renewable energy programs, and do everything we can to ensure the health and safety of all Apple personnel, facilities, and customers in our facilities around the world.\nDescription\nThe EMEIA Development team is responsible for the execution of the retail development strategy across the region.\nThe Development Manager is responsible for the delivery of New Store Openings, refreshes, critical MEP replacement projects, programs, etc. from concept to close out.\nResponsibilities\nEnsure that projects are set up properly and with best practice processes and systems to ensure the teams can operate efficiently and effectively using the business workflow process and Apple Standards of quality and design.\nDirectly handle projectʼs schedule, budget, quality, safety, and facilities turnover.\nDrive functional and operational excellence of all projects and programs by providing consistent and prescript feedback to all cross functional teams including real estate, design, innovation, standards, merchandising, direct sourcing, security, IS&T, etc.\nAssist with the creation off project Proforma, budget and schedule at relevant and key stages within the workflow process (Gate1, Gate2, Schematic Design Review, GC Contract signing).\nRelationship management and responsibility for appointing and signing off external partners and contracts to include design consultants, vendors, contractors, etc.\nReview of lease terms and collaborate with leasing manager to obtain all necessary approvals from the landlord.\nEngage and maintain positive working relationships with local government  jurisdictions/departments, works council, etc.\nManagement of commissioning agents and development of sequence of operations.\nManagement of the closeout process, warranty, construction defects and design errors and omissions.\nTurnover of the project or program to the facilities team.\nEngagement of general contractors, consultants, and vendors including competitive bidding and negotiation including SOWs, CPSAs, and project specific contracts.\nReview of all proposals, and change order requests from suppliers, consultants, general contractors and subcontracts.\nPrepare and present comparative analysis.\nMinimum Qualifications\nConstruction/project management experience with a demonstrated focus in delivering outstanding retail stores or workplaces internationally.\nExperience in large developments such as retail store expansions, campuses, and other hyper scale construction.\nExpertise in the planning, scheduling, budgeting, resourcing, and executing of all technical services required to maintain and improve a large real estate portfolio. This includes mechanical, electrical, plumbing, controls, fire-alarm, lighting, furniture, etc.\nProven ability to collaborate with internal and external partners to meet deadlines and project schedule.\nAbility to balance the trade-offs between operational risk and investment, constantly seeking the highest quality and design at the best value.\nExcellent leadership, communication (keynote), and supervisory skills, including experience working with all levels of an organization and ability to handle customer service issues involving employees in a professional and positive manner.\nAbility to develop cost estimates, cash flows, schedules, and analyze Total Cost of Ownership (TCO) and Whole Life Cycle costs.\nExperience building and maintaining relationships with facility operation teams, utility companies, government agencies, architectural & design firms, and general contracting firms.\nMinimum 50% travel required.\nPreferred Qualifications\nBachelor's Degree in Mechanical, Electrical, Industrial, Civil, Architectural and Construction Management preferred.\nStrong background in data center/commercial/industrial construction to include mechanical, electrical, process piping, plumbing building systems, tenant improvement with bespoke architectural finishes, site work and ground up construction.\nVery proactive, responsive, and upbeat with strong organizational skills; takes on new opportunities and tough challenges with a sense urgency, high energy, and enthusiasm.\nDemonstrated success in running multiple projects, priorities, and people concurrently in a fast-paced, high growth, and results driven environment."
}
