{
  "job_id": "nike_department_manager/coach_zaragoza",
  "company": "Nike",
  "role": "Department Manager/Coach",
  "location": "Zaragoza, Spain",
  "seniority": "Mid-level",
  "responsibilities": [
    "Offer exceptional customer service to deliver premium brand experiences.",
    "Lead, mentor, and motivate department employees to ensure an excellent work environment.",
    "Manage daily operations in the department to achieve sales goals.",
    "Identify and improve areas based on customer feedback.",
    "Represent the brand in NIKE initiatives and train the team.",
    "Ensure the store complies with all NIKE standards and guidelines.",
    "Collaborate with business partners in stores and headquarters.",
    "Lead a team to efficiently receive products, perform accurate inventories, and meet presentation standards.",
    "Ensure all inventory processes function well to keep the sales floor full and well-presented.",
    "Manage the overall in-store product experience.",
    "Prepare for monthly launch initiatives.",
    "Use reporting tools to make informed business decisions.",
    "Perform accurate inventory to complete digital orders.",
    "Ensure the team has the tools to deliver high-quality athlete experiences.",
    "Lead NIKE Community Ambassador activities to strengthen the team.",
    "Oversee the hiring and onboarding process in collaboration with experienced store leaders.",
    "Manage store schedules.",
    "Collaborate with the store team to implement and maintain a positive NIKE culture.",
    "Model excellent sales floor service and enhance the customer experience.",
    "Ensure the team has brand knowledge and can use digital services.",
    "Complete specific training and inform athlete services.",
    "Use data and analysis to provide information and collaborate with experienced store leaders for continuous improvement."
  ],
  "must_have_requirements": [
    "Passion for NIKE and sports.",
    "More than 2 years of experience in store or leadership positions.",
    "Very good oral and written English skills.",
    "Skills and experience to provide exceptional customer service.",
    "Ability to train and develop a strong team.",
    "Focus on communication.",
    "Flexibility to work different shifts and weekends."
  ],
  "nice_to_have_requirements": [],
  "skills": [
    {
      "skill": "Customer Service",
      "importance": 9
    },
    {
      "skill": "Leadership",
      "importance": 8
    },
    {
      "skill": "Sales Management",
      "importance": 7
    },
    {
      "skill": "Team Management",
      "importance": 8
    },
    {
      "skill": "Communication",
      "importance": 9
    },
    {
      "skill": "Inventory Management",
      "importance": 7
    },
    {
      "skill": "Visual Merchandising",
      "importance": 6
    },
    {
      "skill": "English",
      "importance": 7
    }
  ],
  "tech_stack": [],
  "years_of_experience_required": 2,
  "summary_of_experience": {
    "years_minimum": 2,
    "years_maximum": 0
  },
  "raw_text": "Nike Department Manager/Coach - Nike Store Zaragoza\nFull Time\nRetail Stores\nPuerto Venecia Tr.ª De Los Jardines Reales, 7, Zaragoza, Zaragoza 50021, Spain\n\nComo Coach, disfrutarás de:\n\nUtilizar tus capacidades en el ámbito del servicio excepcional al cliente para ofrecer las experiencias de una marca premium a nuestros clientes.\n\nLiderar, asesorar y motivar a empleados de tu departamento y garantizar un ambiente de trabajo excelente.\n\nGestionar el trabajo diario en tu departamento para alcanzar los objetivos de ventas (por ejemplo, con servicios digitales, presentaciones visuales o en la sala de ventas).\n\nIdentificar y mejorar las zonas según los comentarios de los clientes.\n\nRepresentar a la marca en las iniciativas de NIKE y formar al equipo.\n\nGarantizar que la tienda cumple con todos los estándares y las directrices de NIKE.\n\nColaborar con tus partners comerciales en las tiendas y en la sede central.\n\nMás en concreto, la estructura de nuestras tiendas presenta las 3 funciones de coach siguientes:\n\nCOMERCIAL\n\nLiderar un equipo que puede recibir productos de forma eficiente, realizar inventarios precisos y cumplir con los estándares de presentación.\n\nGarantizar que los procesos de todos los inventarios funcionan bien para que la sala de ventas esté siempre llena, tenga una buena presentación y cumpla con los estándares de la marca.\n\nTrabajar con leaders de departamento que supervisarán los componentes individuales (recepción de productos y presentación visual) mientras te encargas de la experiencia general en tienda con los productos.\n\nEstar a cargo de preparar las iniciativas de los lanzamientos mensuales.\n\nUtilizar nuestras herramientas de informes para tomar las mejores decisiones comerciales.\n\nRealizar un inventario preciso para completar los pedidos digitales.\n\nEXPERIENCIA DE ATHLETES\n\nGarantizar que el equipo cuenta con las herramientas para ofrecer experiencias de athletes de la máxima calidad (Objetivo).\n\nLiderar las actividades de NIKE Community Ambassador para fortalecer el equipo.\n\nSupervisar el proceso de contratación e incorporación en colaboración con store leaders con experiencia.\n\nEncargarte de los horarios de la tienda.\n\nColaborar con el equipo de la tienda para implementar y mantener una cultura NIKE positiva.\n\nEXPERIENCIA DE LOS CLIENTES\n\nDar ejemplo de cómo ofrecer nuestro servicio en la sala de ventas y animar la experiencia de los clientes.\n\nGarantizar recursos para que el equipo cuente con conocimientos de la marca sobre todos los aspectos del servicio al cliente, como utilizar los servicios digitales.\n\nCompletar formaciones específicas e informar a los servicios de athlete.\n\nUtilizar datos y análisis para ofrecer información y colaborar con store leaders con experiencia para mejorar continuamente.\n\nEstos son los beneficios:\n\nUn sueldo atractivo que evoluciona con el mercado y la experiencia.\n\nLa oportunidad de recibir bonificaciones mensuales. \n\nDescuentos interesantes para empleados en tienda y online.\n\nUn paquete de ventajas increíble.\n\nOportunidades laborales y de formación emocionantes.\n\nFormaciones habituales sobre liderazgo, ventas y productos.\n\nUn ambiente motivador y dinámico en el que se valora la diversidad, la equidad y la inclusión.\n\nUniforme de empleado para representar a NIKE y fomentar el espíritu de equipo.\n\nAcceso a actividades deportivas.\n\nOportunidades para participar en momentos NIKE únicos.\n\nEsto es lo que tienes que ofrecer:\n\nPasión por NIKE y por el deporte.\n\nMás de 2 años de experiencia en tienda o en puestos de liderazgo. \n\nConocimientos muy buenos de inglés oral y escrito.\n\nCompetencias y experiencia para ofrecer un servicio excepcional al cliente.\n\nCapacidad de formar y desarrollar un equipo sólido. \n\nCentrarte en la comunicación.\n\nFlexibilidad para trabajar en distintos turnos y los fines de semana.\n\nEcha un vistazo a este vídeo para saber más del ambiente y las tradiciones de nuestras tiendas.\n\n¿Te hemos llamado la atención y quieres apoyarnos en nuestra misión para brindar inspiración e innovación para cada atleta del mundo? Envía tu solicitud online: es fácil. ¡Te esperamos!"
}
