{
  "job_id": "tuifly_preparation_crewplanner_langenhagen",
  "company": "TUIfly",
  "role": "Preparation Crewplanner",
  "location": "Langenhagen, Germany",
  "remote": "Hybrid",
  "contract_type": "fixed term",
  "seniority": "Mid-level",
  "responsibilities": [
    "Ensure smooth operations at all crew stations through clever and cost-optimised work preparation.",
    "Allocate flight programs to various crew stations for cockpit and cabin personnel, considering all legal, tariff, and operational requirements.",
    "Calculate capacities for flight personnel's days off and continuously optimise capacities from the flight program for each crew station.",
    "Plan international stops and special flight routings, coordinate special assignments, and arrange suitable proceeding variants.",
    "Analyse deviations in the flight program and find solutions with internal and external interfaces.",
    "Contribute ideas to monthly optimisation proposals for circulation and flight planning and capacity control to improve processes."
  ],
  "must_have_requirements": [
    "Completed commercial vocational training or a degree in business administration, tourism, or aviation.",
    "Relevant practical experience in the commercial field or a comparable position.",
    "Ability to quickly grasp complex relationships and develop creative, practical solutions.",
    "High resilience and concentration ability to maintain composure in time-critical situations.",
    "Team player with good communication and listening skills, and willingness to take responsibility.",
    "Willingness to work shifts.",
    "Very good MS Office skills.",
    "Good negotiation skills in German.",
    "Basic knowledge of English."
  ],
  "nice_to_have_requirements": [],
  "skills": [
    {
      "skill": "MS Office",
      "importance": 7
    },
    {
      "skill": "German",
      "importance": 7
    },
    {
      "skill": "English",
      "importance": 4
    },
    {
      "skill": "Communication",
      "importance": 7
    },
    {
      "skill": "Teamwork",
      "importance": 7
    },
    {
      "skill": "Problem-solving",
      "importance": 7
    },
    {
      "skill": "Organisation",
      "importance": 7
    }
  ],
  "years_of_experience_required": 3,
  "tech_stack": [
    "MS Office"
  ],
  "experience_summary": {
    "years_minimum": 3,
    "years_maximum": 0
  },
  "raw_text": "PREPARATION CREWPLANNER (M/W/D)\n\nLangenhagen, Germany\nHybrid\nFixed term\nPart Time\n\nFür die TUIfly GmbH suchen zum nächstmöglichen Zeitpunkt und für die Dauer von 2 Jahren engagierte, motivierte KollegInnen, die Freude haben, unser Team in Teilzeit  tatkräftig zu unterstützen und damit wesentlich zum Unternehmenserfolg beizutragen. Als Preparation Crewplanner bist Du verantwortlich für die kosten- und ressourcenoptimierte Zuordnung und Koordination unseres Flugprogramms für die jeweiligen Crewstationen , um einen reibungslosen und effizienten Flugbetrieb zu gewährleisten. \n\nUNSER ANGEBOT\nPersönliche Benefits: Attraktive Vergütung, großzügige Reisevorteile, umfangreiche Health & Wellbeing Angebote uvm.\nFlexibles Arbeiten: Wir glauben, dass Arbeit etwas ist, was man tut, und nicht wohin man geht. Wir fördern eine gesunde Work-Life-Balance mit einem dynamischen Arbeitsumfeld\nEine Karriere zum Gestalten: Nutze den TUI Learning Hub, um dich weiterzuentwickeln und deine Ambitionen zu verwirklichen.\nErweitere dein Netzwerk: Wir stehen für interkulturelle Zusammenarbeit und bieten die Möglichkeit der Arbeit in internationalen Projekten und Teams\nGemeinschaft: Engagiere dich für wunderbare lokale Wohltätigkeits- und Nachhaltigkeitsinitiativen wie die TUI Care Foundation\nDEINE AUFGABEN\nDu sorgst mit einer cleveren und kostenoptimierten Arbeitsvorbereitung dafür, dass an allen Crewstationen alles rundläuft und die Ressourcen der jeweiligen Berufsgruppe bestmöglich eingesetzt werden.\nDie Zuordnung des Flugprogramm für die verschiedenen Crewstationen sowie für Cockpit- und Kabinenpersonal – selbstverständlich unter Berücksichtigung aller gesetzlichen, tariflichen und betrieblichen Vorgaben gehört zu den Hauptaufgaben.\nEbenso die Berechnung von Kapazitäten für freie Tage des Flugpersonals und die kontinuierliche Optimierung der Kapazitäten aus dem Flugprogramm für die jeweilige Crewstationen gehören zu Deinen Aufgaben.\nMit Weitblick und Organisationstalent planst Du Auslandsstops und besondere Flugumläufe, koordinierst spezielle Einsätze und kümmerst Dich um die Buchung passender Proceeding-Varianten.\nWenn es zu Abweichungen im Flugprogramm kommt, behältst Du den Überblick, analysierst die Situation und findest gemeinsam mit internen und externen Schnittstellen die beste Lösung.\nZudem bringst Du Deine Ideen in monatliche Optimierungsvorschläge für die Umlauf- und Flugplanung und Kapazitätssteuerung ein und trägst so aktiv dazu bei, Prozesse stetig zu verbessern und noch effizienter zu gestalten.\nDEIN PROFIL\nEine abgeschlossene kaufmännische Berufsausbildung oder ein betriebswirtschaftliches Studium – alternativ ein Studium im Bereich Tourismus oder Luftverkehr – bilden die Grundlage Deiner Qualifikation.\nDu hast bereits relevante Praxiserfahrung im kaufmännischen Bereich oder in einer vergleichbaren Position gesammelt.\nKomplexe Zusammenhänge werden von Dir schnell erfasst, und kreative, praxisorientierte Lösungen gehören zu Deinen Stärken.\nEine hohe Belastbarkeit und ausgeprägte Konzentrationsfähigkeit ermöglichen es Dir, auch in zeitkritischen Situationen einen kühlen Kopf zu bewahren.\nDu bist ein echter Teamplayer, der gerne kommuniziert, zuhört und Verantwortung übernimmt.\nBereitschaft zum Schichtdienst sowie sehr gute MS Office-Kenntnisse, gute verhandlungssichere Deutschkenntnisse und grundlegende Englischkenntnisse runden Dein Profil ab.\n\nHINWEIS ZUR SICHERHEITSÜBERPRÜFUNG: Sicherheit hat bei TUI oberste Priorität. Deshalb führen wir für alle Mitarbeitenden im Airline-Bereich umfassende Hintergrundprüfungen durch und informieren dich Schritt für Schritt über die erforderlichen Unterlagen.Für Bewerbungen gilt: Du musst Referenzen über die letzten fünf Jahre sowie ein Führungszeugnis aus allen Ländern vorlegen, in denen du in diesem Zeitraum über sechs Monate gelebt hast (ggf. fallen Kosten an)."
}
