{
  "job_id": "spotify_senior_visual_designer_london",
  "company": "Spotify",
  "role": "Senior Visual Designer",
  "location": "London",
  "seniority": "Senior",
  "responsibilities": [
    "Work in a cross-functional team to build and maintain the foundational building blocks of Spotify’s digital applications.",
    "Set new standards for visual craft and execution across our product.",
    "Proactively explore and implement AI-driven solutions to create desirable design outputs.",
    "Partner with product designers to develop and improve styles and patterns.",
    "Build work that scales across various audiences, devices, platforms, and form factors.",
    "Empower internal designers by providing resources and clarity around design and accessibility best practices.",
    "Take ownership of work and drive personal development."
  ],
  "must_have_requirements": [
    "Exceptional visual design skills with a keen eye for craft, clarity, and consistency.",
    "Familiarity working within and contributing to large design systems.",
    "Experience working in-house for consumer-facing digital product companies.",
    "Value inclusive design and accessibility.",
    "Thoughtful designer and problem solver who questions the status quo.",
    "Online portfolio or PDF."
  ],
  "nice_to_have_requirements": [],
  "skills": [
    {
      "name": "Visual Design",
      "importance": 10,
      "years_of_experience": 3
    },
    {
      "name": "Design Systems",
      "importance": 9,
      "years_of_experience": 3
    },
    {
      "name": "AI",
      "importance": 7,
      "years_of_experience": 0
    },
    {
      "name": "Workflow Automation",
      "importance": 6,
      "years_of_experience": 0
    },
    {
      "name": "Creative Tooling",
      "importance": 6,
      "years_of_experience": 0
    },
    {
      "name": "Accessibility",
      "importance": 7,
      "years_of_experience": 0
    },
    {
      "name": "Inclusive Design",
      "importance": 7,
      "years_of_experience": 0
    }
  ],
  "tech_stack": [
    "AI",
    "Design Systems"
  ],
  "years_of_experience_min": 3,
  "years_of_experience_max": 0,
  "raw_text": "Senior Visual Designer\nDesign Systems\n\nLondon\nWe’re looking for a Senior Visual Designer to join Spotify’s central Design Systems team. In this role, you’ll help shape the future of Encore—Spotify’s design system that powers both our design tools and accessibility efforts. You’ll bring ideas to life with excellent visual design, and find smart, practical ways to improve how designers work—through better tooling, AI, and more efficient ways of building.\nYou care deeply about graphic design and user interfaces, and understand how they are served by design systems. You listen closely to your teammates and the people who use your work, and you lead with thoughtful, high-quality design that sets a strong example for others.\n\nWhat You'll Do\n\nWork day-to-day in a cross-functional team of engineers, designers including content designer and staff typographer, producers and product managers to build and maintain the foundational building blocks of Spotify’s digital applications.\nSet new standards for visual craft and execution across our product.\nProactively explore and implement AI-driven solutions — you understand how to use AI to input the right context to create desirable design outputs.\nPartner with product designers around the company to develop and improve styles and patterns.\nBuild work that scales and flexes across a variety of audiences, devices, platforms and form factors ranging from phones over laptop computers to game consoles, connected fridges and cars\nEmpower our internal community of 100+ globally distributed designers by providing resources and clarity around Spotify’s design and accessibility best practices.\nBe autonomous. You take full ownership of your work and drive your personal development. You care for every last detail, every step of the way.\n\nWho You Are\n\nYou demonstrate exceptional visual design skills with a keen eye for craft, clarity, and consistency - bringing innovation to interaction, spacing, and visual storytelling.\nYou embrace the usage AI and new technologies, and have experience building workflow automations and creative tooling.\nYou are familiar and comfortable working within and contributing to large design systems that you may or may not own directly.\nYou have experience working in-house for consumer-facing digital product companies.\nYou value inclusive design and accessibility and don’t believe it has to mean compromising aesthetics.\nYou are a thoughtful designer and problem solver who questions the status quo and strives for improvement.\nYou have an online portfolio or PDF that you can share with us.\n\nWhere You'll Be\n\nThis role is based in London, UK.\nWe offer you the flexibility to work where you work best! There will be some in person meetings, but still allows for flexibility to work from home."
}
