{
  "job_id": "nike_senior_product_manager_karnataka",
  "company": "Nike",
  "role": "Senior Product Manager",
  "location": "Karnataka, India",
  "seniority": "Senior",
  "responsibilities": [
    "Define and drive the product roadmap and strategies in alignment with Nike's CSR and FY AOP.",
    "Translate product roadmap features into well-defined product requirements, including epics and user stories.",
    "Partner with engineering on design solutions and architectural decisions.",
    "Work efficiently in an Agile environment, validating completed stories and ensuring they meet business expectations.",
    "Track product features and performance metrics to ensure targets are met or exceeded.",
    "Track value drops delivered, product adoption, and execution against the end-to-end roadmap.",
    "Communicate effectively in various settings and tailor communications to the target audience.",
    "Influence others through optimism, self-assurance, and fact-based recommendations."
  ],
  "must_have_requirements": [
    "5+ years of Product Management experience in the e-commerce domain.",
    "Experience in Digital Marketing.",
    "Bachelor of Engineering in computer science or combination of relevant education, experience.",
    "Prior experience owning experiences and platforms implemented on AWS Cloud, microservices architecture, domain event architecture.",
    "Ability to work on multiple streams of work in parallel.",
    "Ability to proactively identify risks and dependencies.",
    "Crisp communication skills.",
    "Ability to break down and simplify complex processes and concepts.",
    "Great business acumen and communication skills.",
    "Excellent analysis and problem-solving skills.",
    "Validated ability to adapt to changing needs, processes, and ambiguity.",
    "Strong meeting and work session facilitation skills.",
    "Solid grasp on Design Thinking Concepts and Design Leadership."
  ],
  "nice_to_have_requirements": [
    "Experience with Agile tools, JIRA, Confluence, Splunk, figma/lucid chart, SQL is a plus."
  ],
  "skills": [
    {
      "name": "Product Management",
      "importance": 10,
      "years_of_experience": 5
    },
    {
      "name": "E-commerce",
      "importance": 8,
      "years_of_experience": 0
    },
    {
      "name": "Digital Marketing",
      "importance": 8,
      "years_of_experience": 0
    },
    {
      "name": "AWS Cloud",
      "importance": 7,
      "years_of_experience": 0
    },
    {
      "name": "Microservices Architecture",
      "importance": 7,
      "years_of_experience": 0
    },
    {
      "name": "Domain Event Architecture",
      "importance": 7,
      "years_of_experience": 0
    },
    {
      "name": "Agile",
      "importance": 6,
      "years_of_experience": 0
    },
    {
      "name": "JIRA",
      "importance": 4,
      "years_of_experience": 0
    },
    {
      "name": "Confluence",
      "importance": 4,
      "years_of_experience": 0
    },
    {
      "name": "Splunk",
      "importance": 4,
      "years_of_experience": 0
    },
    {
      "name": "Figma",
      "importance": 4,
      "years_of_experience": 0
    },
    {
      "name": "Lucidchart",
      "importance": 4,
      "years_of_experience": 0
    },
    {
      "name": "SQL",
      "importance": 4,
      "years_of_experience": 0
    },
    {
      "name": "Communication Skills",
      "importance": 9,
      "years_of_experience": 0
    },
    {
      "name": "Problem-solving",
      "importance": 8,
      "years_of_experience": 0
    },
    {
      "name": "Design Thinking",
      "importance": 6,
      "years_of_experience": 0
    }
  ],
  "tech_stack": [
    "AWS",
    "SQL",
    "JIRA",
    "Confluence",
    "Splunk",
    "Figma",
    "Lucidchart"
  ],
  "summary_of_experience": {
    "years_minimum": 5,
    "years_maximum": 0
  },
  "raw_text": "Senior Product Manager\n\nLocation\n4/F, WeWork, Embassy GolfLinks, Karnataka, Karnataka 560093, India\n\nWHO YOU’LL WORK WITH\n\nHe/She will be working as part of Geographies and Marketplace experiences (GAME) Global Technology organization. Within this organisation he/she will be part of Marketing Technology.\n\nWithin the Marketing Technology Products organization, ITC teams are focused on building and scaling Nike’s Content Technology, Communications, and Paid Media capabilities, while advancing Gen AI/ML-driven marketing innovations. Digital Marketing powers Nike’s B2C consumer experiences — including Nike.com , Nike App, NRC, NTC, and SNKRS — driving personalized, connected, and insight-led journeys that strengthen consumer relationships across Nike’s global e-commerce ecosystem\n\nSr. Product Manager plays an integral part of the Global Technology team as Nike is focused on the Win Now Strategy. This position sits within India Technology Centre (ITC) reporting to Director of Product Management GAME ITC.\n\nHe/She will be working closely with Engineering, Architecture, Global Product Managers and business stakeholders located in WHQ and cross functional teams within and outside of ITC.\n\nWHO WE ARE LOOKING FOR\n\nWe seek a visionary Sr Product Manager with a passion for serving the consumers. The ideal candidate will have a proven track record in product management, exceptional analytical skills, and the ability to collaborate across cross functional teams. He/she should be driven by data and insights, with a focus on delivering an ultimate consumer experience. Strong leadership, communication, are essential, with experience forming alliances and bringing together multiple partners to execute on a common mission.\n\nWe're looking for someone with 5+ years of Product Management experience in the e-commerce domain with experience in Digital Marketing and clearly demonstrates these skills:\n\nBachelor of Engineering in computer science or combination of relevant education, experience\n\nPrior experience owning experiences and platforms implemented on AWS Cloud, micros services architecture, domain event architecture\n\nAbility to work on multiple streams of work in parallel, proactively identify risks and dependencies and constantly keep stakeholders updated on progress\n\nCrisp communication skills and ability to tailor communication based on the technical and functional prowess of the audience.\n\nAbility to break down and simplify complex processes and concepts and sketch them out and articulate them with ease\n\nExperience with Agile tools, JIRA, Confluence, Splunk, figma/lucid chart, SQL is a plus.\n\nGreat business acumen and communication skills\n\nExcellent analysis and problem-solving skills\n\nValidated ability to adapt to changing needs, processes, and ambiguity\n\nStrong meeting and work session facilitation skills\n\nSolid grasp on Design Thinking Concepts and Design Leadership\n\nWHAT YOU’LL WORK ON\n\nAs a Sr Product Manager for Marketing Technologies He/She will\n\nDefine and drive the roadmap and strategies to ensure it aligns with Nike’s CSR and FY AOP in partnership with functional leadership as well as business/ops teams. Translate product roadmap features into well-defined product requirements including epics, user stories and be the owner of the backlog Partner with engineering on design solutions and architectural decisions and advocate the technical directions, and evaluate decisions and their impact on the business functionalities. Work efficiently in Agile environment, regularly validate the completed stories and check with the business or program to ensure it meets business product expectation. Track product features, performance metrics to ensure that the product is meeting or exceeding the targets, pivot the product roadmap direction as needed. Track value drops delivered, product adoption, and execution against the end-to-end roadmap. Great product sense and communicate effectively both verbally and written in a variety of settings and tailor communications to the target audience. Influence others through optimism, self-assurance, and fact-based recommendations.\n\nNIKE, Inc. is a growth company that looks for team members to grow with it. Nike offers a generous total rewards package, casual work environment, a diverse and inclusive culture, and an electric atmosphere for professional development. No matter the location, or the role, every Nike employee shares one galvanizing mission: To bring inspiration and innovation to every athlete* in the world.\n"
}
