{
  "job_id": "nazar_nordic_service_guide_side",
  "company": "Nazar Nordic",
  "title": "Service Guide or Combi Guide",
  "location": "Side, Turkey",
  "country": "Turkey",
  "seniority": "Mid-level",
  "department": null,
  "salary": null,
  "currency": null,
  "responsibilities": [
    "Welcoming and assisting guests at arrival and departure at the airport",
    "Providing service at hotels and via digital channels (SMS, chat & phone)",
    "Handling questions, situations, and problem solving",
    "Collaboration with hotel partners to ensure a smooth and memorable stay",
    "Providing personal service at family hotels",
    "Handling digital service and problem solving",
    "Leading kids club activities for children aged 4-11",
    "Planning and running fun programs, games, and mini disco performances on stage",
    "Coordinating activities in collaboration with the hotel",
    "Creating a safe, fun and energetic environment"
  ],
  "requirements": [
    "Positive attitude and a genuine interest in people and service",
    "Enjoy working internationally and taking responsibility",
    "Flexible and solution-orientated",
    "Fluent in Swedish, Norwegian, Danish or Finnish",
    "Communicate confidently in English",
    "Available for the full season (April/May - September/October)",
    "Hold a valid B driver's license, valid for a minimum of one full calendar year from arrival"
  ],
  "nice_to_have": [
    "Experience in service, events, hotels, children activities, or tourism"
  ],
  "skills": [
    {
      "name": "Customer Service",
      "importance": 8
    },
    {
      "name": "Communication",
      "importance": 7
    },
    {
      "name": "Problem Solving",
      "importance": 7
    },
    {
      "name": "Flexibility",
      "importance": 9
    },
    {
      "name": "International Work Experience",
      "importance": 6
    },
    {
      "name": "Swedish",
      "importance": 7
    },
    {
      "name": "Norwegian",
      "importance": 7
    },
    {
      "name": "Danish",
      "importance": 7
    },
    {
      "name": "Finnish",
      "importance": 7
    },
    {
      "name": "English",
      "importance": 9
    },
    {
      "name": "Driving",
      "importance": 6
    }
  ],
  "tech_stack": [],
  "years_of_experience_required": 0,
  "years_of_experience_preferred": 1,
  "experience_summary": {
    "total": 0,
    "relevant": 0,
    "programming": 0,
    "data_science": 0,
    "machine_learning": 0,
    "devops": 0
  },
  "raw_text": "Nazar Nordic | Nordic Service Guide or Combi Guide summer 2026\nSide, Turkey\nRhodes, Greece; Paralímni, Cyprus\nService Guide \n\nAs service guide you are the guests main contact thorughout their stay. Your tasks include:\n\nWelcoming and assisting guests at arrival and departure at the airport\nProviding service at hotels and via digital channels (SMS, chat & phone)\nHandling questions, situations, and problem solving\nCollaboration with hotel partners to ensure a smooth and memorable stay\nWorking a varied schedule, including day, evening, night and weekend shifts\n\nThis position is for someone flexible, solution-orientated, and thrives when no two days are the same. \n\nCombi Guide - Turkey\n\nThe Combi Guide in Turkey combines service and activity responsibilities. Your tasks includes:\n\nProviding personal service at one of our largets family hotels\nHandling digital service and problem solving  \nLeading kids club actiuvities for children in age 4-11 \nPlanning and running fun programs, games, and mini disco performances on stage \nCoordinating activities in collaboration with the hotel\nUsing creativity to make holiday dreams come true for children and families  \nFlexible schedule, including day, evening, and weekend shifts\n\nCombi Guide - Rhodes\n\nThe Combi Guide in Rhodes also combines service and activity responsibilities:\n\nService duties across the island:\n\nAssisting guests in airport during arrivals and departures\nProviding service and support at all our hotels in Rhodes\nHandling digital service and problem solving\n\nKids club duties in one of our family hotels:\n\nLeading activities for children 4-11 years old\nPlanning fun program, games, and mini disco performances at stage \nCreating a safe, fun and energetic environment\n\nThis position as well includes flexible schedule, including day, evening, night and weekend shifts\n\nWho we are looking for\n\nWe seek individuals who:\n\nHave a positive attitude and a genuine interest in people and service.\nEnjoy working internationally and taking responsibility. \nAre flexible and solution-orientated,\nSpeak fluent Swedish, Norweigan, Danish or Finnish.\nCommunicate confidentially in English.\nAre available for the full season (April/May - September/October)\nHold a valid B driver´s license, and it must be valid for a minimum of one full calendar year from your arrival at the destination.\n\nMerits, but not required:\n\nExperience in service, events, hotels, children activities, or tourism.\n\nPersonality and motivation are our top priorities.\n\nWhat we offer\n\nInternal training before season start.\nCompany provided accommodation free of charge and all reasonable accommodation costs are taken care by Nazar.\nFlight tickets covered according to your terms outlines in your contract.\nYou will have a legal employment contract, valid insurance from Nordic´s, and official work permit (if/when required in destination country).\nMonthly salary paid in Euro or Turkish lira. \nA workplace full of energy, teamwork, and development possibilities.\nA culture where you are part of the Nazar family from day one..\n\nAbout Nazar Nordic\n\nNazar is part of the TUI Group, the world´s largest travel company.\nWe have a great lineup of carefully selected hotels, each with its own special charm and concept.\nWe specialize in All Inclusive travels with over 20 years of experience.\nWe create unforgettable holiday experiences for Nordic guests.\n\nApplication\n\nDoes one of these positions sounds like your next challenge?\n\nSend your application today - selection is ongoing!\n\nPlease indicate which position you are applying for: Service Guide or Combi Guide, and feel free to attach both your CV and cover letter.\n\nWe look forward to welcoming you for the summer of 2026 and an unforgetable experience at the destination!"
}
