{
  "job_id": "tui_hotel_rep_kos",
  "company": "TUI",
  "role": "Hotel Rep",
  "location": "Kos, GRC",
  "seniority": "Mid-level",
  "responsibilities": [
    "Create special moments for guests and build strong connections.",
    "Identify guest needs and offer tailored recommendations.",
    "Promote and sell experiences to match guest preferences and exceed sales targets.",
    "Handle changes and challenging situations effectively.",
    "Collaborate with colleagues, teams, suppliers, and partners.",
    "Monitor progress with sales, service updates, and guest feedback.",
    "Meet sales targets, solve problems, and provide great service."
  ],
  "must_have_requirements": [
    "Right to work in Greece",
    "Fully conversational in English",
    "Driving license (if required for the role)"
  ],
  "nice_to_have_requirements": [
    "Additional languages",
    "Tourism & hospitality diploma"
  ],
  "skills": [
    {
      "name": "Communication",
      "importance": 8,
      "years_of_experience": 0
    },
    {
      "name": "Sales",
      "importance": 9,
      "years_of_experience": 0
    },
    {
      "name": "Customer Service",
      "importance": 10,
      "years_of_experience": 0
    },
    {
      "name": "Problem Solving",
      "importance": 8,
      "years_of_experience": 0
    },
    {
      "name": "Driving",
      "importance": 7,
      "years_of_experience": 0
    }
  ],
  "tech_stack": [
    "iPad"
  ],
  "min_years_experience": 0,
  "max_years_experience": 0,
  "summary_experience": 0,
  "raw_text": "TUI Hotel Rep | Local Residents\n\nKos, GRC\nOnsite\nLocally employed contract\nFull Time\nSummer 26\n135731\n\nCalling all tourism pros based in Kos!\n\nWe are seeking digital experienced and helpful individuals like you to join our diverse team of Hotel Reps. If you have the right to work in Greece and speak English, then keep on reading! \n\nABOUT OUR OFFER\nA job at TUI offers more than your basic salary which already starts at 1.132€ gross/month, and your earned commission on top. For TUI Hotel Reps, an average commission potential starting from 400€ per month with no upper limit - the more you sell, the more you earn. Please note that your final salary may increase depending on your personal status (such as marital status and children) and whether you hold a tourism & hospitality diploma.\nA company iPad & uniform are of course standard.\nFor roles that require driving within our resorts, a company car will be provided. Alternatively, if the role requires driving and you use your own vehicle for work-related travel, you will receive a €200 monthly allowance along with additional reimbursement for fuel expenses. \nWork week of 40 hours with minimum 1.5 days off.\n2 days of holidays per month.\nWe pay you for all training days completed plus free access to our TUI Learning Hub, TUI Skills Academy & language lessons.\nGet involved with charity and sustainability initiatives like the TUI Care Foundation and complimentary access to our dedicated WeCare Team & 24/7 Wellbeing Hub.\nWe offer permanent or seasonal contracts, but either way you can level up your career with growth opportunities tailored to your unique skills and expertise.\nABOUT THE JOB\nCreate special moments for our guests. Make them feel welcome and happy, building a strong connection with each one.\nEngage with guests from around the world to identify their needs and offer tailored recommendations. Promote and sell our experiences effectively to match our products with guests’ preferences, aiming to exceed sales targets and boost revenue.\nBe prepared to handle changes and challenging situations effectively to provide the best possible service to our guests.\nCollaborate with colleagues, teams, suppliers, and partners from all over the world and embrace our diverse TUI culture.\nMonitor progress with sales and service updates, as well as guest feedback. Celebrate successes in meeting sales targets, solving problems, and providing great service.\nABOUT YOU\nDedicated to making our guests happy, going above and beyond to create unforgettable experiences.\nA quick learner, ready to master the technology and tools needed for the role. Embrace new knowledge and feedback, and enthusiastic about getting to know our amazing products and services.\nA highly motivated, target-driven person with a positive mindset towards achieving results. Dedicated to caring for customers, selling products that match their needs, and ensuring they have the best possible experience.\nTurning challenges into opportunities and remain calm under pressure. Proactively identify and resolve issues creatively before they escalate. \nCommunicate clearly and effectively. Able to adjust style to fit the situation, keep interactions positive, and comfortable to present in front of an audience.\nHold a driving license and fully conversational in English. Additional languages would be a great asset.\n\nPlease note: For enquiries only. Applications are only accepted online.\n\nEmail: candidates.tuimm@tui.com"
}
