{
  "job_id": "apple_commercial_legal_counsel_london",
  "company": "Apple",
  "role": "Commercial Legal Counsel",
  "location": "London, England, United Kingdom",
  "seniority": "Mid-level",
  "responsibilities": [
    "Advising and supporting sales and operations on complex contracts and commercial projects.",
    "Negotiating and drafting strategic agreements covering sales, distribution, marketing, and after-sales service of Apple products.",
    "Providing solutions-based advice to all levels of management on complex legal and business issues.",
    "Building relationships and collaborating with multiple teams to identify and resolve issues and close deals."
  ],
  "must_have_requirements": [
    "Juris Doctor or equivalent and qualified in England & Wales.",
    "3 - 7 years of experience (in-house and/or private practice), including sufficient experience on commercial contracts.",
    "Familiarity with competition law and other relevant legal issues related to sales, marketing, and distribution in EMEIA.",
    "Excellent communication and drafting skills."
  ],
  "nice_to_have_requirements": [
    "Creative problem-solver with the business acumen to resolve complex issues in creative and efficient ways to deliver transactions.",
    "Curious, self-starter who thrives in building strong relationships and driving projects involving cross functional teams.",
    "Ability to work in a fast-paced environment and to collaborate with clients based in various geographies.",
    "Sound judgment, strong interpersonal skills, ability to work independently, excellent time management and organizational skills.",
    "Comfortable with healthy debate, and able to handle a variety of matters at once in a fast-paced environment.",
    "Comfortable advising and working with senior and executive management."
  ],
  "skills": [
    {
      "skill": "Legal Advice",
      "importance": 9
    },
    {
      "skill": "Contract Negotiation",
      "importance": 9
    },
    {
      "skill": "Drafting",
      "importance": 8
    },
    {
      "skill": "Communication",
      "importance": 8
    },
    {
      "skill": "Problem-solving",
      "importance": 7
    },
    {
      "skill": "Relationship Building",
      "importance": 7
    },
    {
      "skill": "Time Management",
      "importance": 6
    },
    {
      "skill": "Competition Law",
      "importance": 5
    }
  ],
  "tech_stack": [],
  "years_of_experience_required": 3,
  "experience_summary": {
    "years_minimum": 3,
    "years_maximum": 7
  },
  "raw_text": "Commercial Legal Counsel\nLondon, England, United Kingdom\nCorporate Functions\nSummary\nApple is looking for a passionate and practical Commercial Legal Counsel to join its EMEIA Commercial and International Legal team.  As an active member of the Commercial Legal team and an integrated business partner, the Legal Counsel will have the opportunity to contribute to the success of some of the most groundbreaking products in the world.\n\nDescription\nThe Legal Counsel will join a talented, diverse, and business-oriented group of lawyers and will focus on supporting Apple’s Commercial Sales organization and related cross-function teams, in the sale, marketing, and distribution of Apple products and services in EMEIA. \nResponsibilities\nAdvising and supporting sales and operations on a variety of complex contracts and commercial projects in the consumer channel, including direct engagement with customers and partners.\nNegotiating and drafting strategic agreements covering sales, distribution, marketing, and after-sales service of Apple products.\nProviding solutions-based advice to all levels of management on a wide variety of complex legal and business issues.\nBuilding relationships and collaborating with multiple teams across Apple’s organization to identify and resolve issues and close deals.\nSome travel may be required.\nMinimum Qualifications\nJuris Doctor or equivalent and qualified in England & Wales.\n3 - 7 years of experience (in-house and/or private practice), including sufficient experience on commercial contracts.\nFamiliarity with competition law and other relevant legal issues related to sales, marketing, and distribution in EMEIA.\nExcellent communication and drafting skills: ability to listen, communicate, and draft in a clear and concise manner, present and speak-up, influence, convince, and confront ideas to get to the right decision.\nPreferred Qualifications\nCreative problem-solver with the business acumen to resolve complex issues in creative and efficient ways to deliver transactions.\nCurious, self-starter who thrives in building strong relationships and driving projects involving cross functional teams, with an ability to work in a fast-paced environment and to collaborate with clients based in various geographies.\nSound judgment, strong interpersonal skills, ability to work independently, excellent time management and organizational skills, comfortable with healthy debate, and able to handle a variety of matters at once in a fast-paced environment.\nComfortable advising and working with senior and executive management."
}
