{
  "job_id": "apple_international_marketing_manager_london",
  "company": "Apple",
  "role": "International Marketing Manager",
  "location": "London, England, United Kingdom",
  "seniority": "Mid-level",
  "responsibilities": [
    "Define plans for international marketing initiatives for offers, ensuring high standards, local relevance, clear objectives, and measurable ROI.",
    "Generate ideas for local execution and implement global campaigns to meet Apple standards.",
    "Collaborate with business and editorial teams to build impactful campaigns.",
    "Define marketing priorities and monitor execution.",
    "Manage and expand business relationships with marketing partners.",
    "Analyse and communicate results to leaders."
  ],
  "must_have_requirements": [
    "Marketing experience in content services and subscriptions.",
    "Deep knowledge of owned, digital and above-the-line marketing channels.",
    "Experience working collaboratively in a global company.",
    "Ability to analyse and communicate results to leaders.",
    "Outstanding organisational skills and the ability to balance multiple projects simultaneously.",
    "Proven ability to manage deadlines and work effectively with cross-functional teams.",
    "Deep passion for the Apple brand, Apple’s first party subscription products, and mobile technology.",
    "Strong leadership and communication skills.",
    "Fluency in English."
  ],
  "nice_to_have_requirements": [
    "Additional languages.",
    "Creator marketing experience."
  ],
  "skills": [
    {
      "skill": "Marketing",
      "importance": 9,
      "years_of_experience": 3
    },
    {
      "skill": "Digital Marketing",
      "importance": 8,
      "years_of_experience": 3
    },
    {
      "skill": "Above-the-line Marketing",
      "importance": 7,
      "years_of_experience": 3
    },
    {
      "skill": "Communication Skills",
      "importance": 8,
      "years_of_experience": 0
    },
    {
      "skill": "Leadership Skills",
      "importance": 7,
      "years_of_experience": 0
    },
    {
      "skill": "Stakeholder Management",
      "importance": 7,
      "years_of_experience": 3
    },
    {
      "skill": "Campaign Management",
      "importance": 9,
      "years_of_experience": 3
    },
    {
      "skill": "English",
      "importance": 10,
      "years_of_experience": 0
    }
  ],
  "tech_stack": [],
  "years_of_experience_min": 3,
  "years_of_experience_max": 0,
  "raw_text": "International Marketing Manager, Apple Services\nLondon, England, United Kingdom\nMarketing\nSummary\nPosted:\n21 Nov 2025\nWeekly Hours:\n35\nRole Number:\n200632488-2114\nApple is where imaginations gather together, committing to the values that lead to great work. Every product we build, service we develop, or Apple Store experience we deliver is the result of us making each other’s ideas stronger. That happens because every one of us shares a belief that we can make something wonderful and share it with the world, changing lives for the better. It’s the diversity of our people and their thinking that encourages the innovation that runs through everything we do. When we bring everybody in, we can do the best work of our lives. Here, you’ll do more than join something — you’ll add something.\n\nWe are looking for a talented expert and innovation-driven team member to manage key international marketing programmes for our first party apps businesses, with a focus on offers for an 11 month fixed term position. The best candidate should demonstrate outstanding skills managing complex internal partnerships, strong attention to detail, be resourceful, adaptable, creative, and results-oriented. \n\nDescription\n-  Define plans for our international marketing initiatives for offers, that are developed and driven to a high standard, are locally relevant and tie into global business goals, have clear objectives and a measurable return on investment. \n\n-  Be a generator of ideas for local execution and also implement global campaigns in a way that meets the high Apple standards.\n\n-  Work closely with our business and editorial teams to build iconic and impactful campaigns.\n\n-  Define clear and tangible marketing priorities and monitor / partner around detailed execution.\n\n-  Run and expand business relationships with existing marketing partners & targets.\n\nMinimum Qualifications\nMarketing experience in content services and subscriptions, with deep knowledge of owned, digital and above-the-line marketing channels.\nExperience working collaboratively in a global company, a natural networker who will develop and build positive relationships with business partners and stakeholders.\nHave an ability to analyse and communicate results to leaders in both written and oral formats, and capable of understanding Apple’s overall priorities.\nOutstanding organisational skills and the ability to balance multiple projects simultaneously.\nProven ability to manage deadlines and work effectively with cross-functional teams under daily and weekly deadlines.\nDeep passion for the Apple brand, Apple’s first party subscription products, and mobile technology.\nStrong leadership and communication skills.\nFluency in English is a requirement.\nResourceful, creative, and collaborative.\nPreferred Qualifications\nAdditional languages are a plus.\nCreator marketing experience is a plus."
}
