{
  "job_id": "tuifly_crewplanner_langenhagen",
  "company": "TUIfly",
  "role": "Crew Planner",
  "location": "Langenhagen, Germany",
  "seniority": "Mid-level",
  "responsibilities": [
    "Plan flights, standby duties and simulator training for license retention.",
    "Re-planning of line checks, critical airports and special flights.",
    "Review, analyse and optimise duty rosters in compliance with regulations.",
    "Monthly creation and review of crew member days off capacities.",
    "Represent plan administration (roster maintenance).",
    "Collaborate with interfaces within and outside the crew planning team.",
    "Control and optimise work preparation (pattern) and proceedings.",
    "Ensure monthly capacities for days off are correctly determined.",
    "Participate in plan audits and conduct research.",
    "Adjust plans as needed.",
    "Support the onboarding of new colleagues, interns and trainees.",
    "Contribute to the further development of duty roster design through active participation in projects and suggestions for optimising company agreements and collective agreements."
  ],
  "must_have_requirements": [
    "Completed commercial vocational training or a degree in business administration, tourism or aviation.",
    "Relevant practical experience in the commercial field or in a comparable position.",
    "Ability to quickly grasp complex relationships and provide creative, practical solutions.",
    "High resilience and concentration ability to keep a cool head in time-critical situations.",
    "Team player with good communication skills and a willingness to take responsibility.",
    "Willingness to work shifts.",
    "Very good MS Office skills.",
    "Good negotiation skills in German.",
    "Basic knowledge of English."
  ],
  "nice_to_have_requirements": [],
  "skills": [
    {
      "name": "MS Office",
      "importance": 7
    },
    {
      "name": "Communication",
      "importance": 7
    },
    {
      "name": "Teamwork",
      "importance": 7
    },
    {
      "name": "German",
      "importance": 9
    },
    {
      "name": "English",
      "importance": 4
    }
  ],
  "tech_stack": [
    "MS Office"
  ],
  "years_of_experience_min": 0,
  "years_of_experience_max": 0,
  "years_of_experience_avg": 0,
  "raw_text": "Crewplanner Cockpit (m/w/d)\nLangenhagen, Germany\n\nFür die TUIfly GmbH suchen zum nächstmöglichen Zeitpunkt und für die Dauer von 2 Jahren engagierte, motivierte KollegInnen, die Freude haben, unser Team in Vollzeit tatkräftig zu unterstützen und damit wesentlich zum Unternehmenserfolg beizutragen. Als Crew Planner im Bereich Cockpit bist Du verantwortlich für die Erstellung, Optimierung, Veröffentlichung und Verwaltung der Creweinsatzpläne unter Berücksichtigung aller erforderlichen Lizenzen und Qualifikationen, der gesetzlichen sowie tarifvertraglichen Bestimmung (Manteltarifverträge, Regelabsprachen, Betriebsvereinbarungen, EASA, Manuals etc.) sowie der operationellen und wirtschaftlichen Aspekte. Des Weiteren kümmerst Du Dich um Einplanung von Freistellungen /Flügen und Simulator Training zum Lizenzerhalt. \n\nUNSER ANGEBOT\nPersönliche Benefits: Attraktive Vergütung, großzügige Reisevorteile, umfangreiche Health & Wellbeing Angebote uvm.\nFlexibles Arbeiten: Wir glauben, dass Arbeit etwas ist, was man tut, und nicht wohin man geht. Wir fördern eine gesunde Work-Life-Balance mit einem dynamischen Arbeitsumfeld\nEine Karriere zum Gestalten: Nutze den TUI Learning Hub, um dich weiterzuentwickeln und deine Ambitionen zu verwirklichen.\nErweitere dein Netzwerk: Wir stehen für interkulturelle Zusammenarbeit und bieten die Möglichkeit der Arbeit in internationalen Projekten und Teams\nGemeinschaft: Engagiere dich für wunderbare lokale Wohltätigkeits- und Nachhaltigkeitsinitiativen wie die TUI Care Foundation\nDEINE AUFGABEN\nPlanung von Flügen, Bereitschaftsdiensten und Simulator-Trainings zum Lizenzerhalt sowie die Umplanung von Linechecks, Critical Airports und Sonderflügen gehören zu Deinem Verantwortungsbereich.\nIn dieser Rolle überprüfst, analysierst und optimierst Du die Dienstpläne unter Berücksichtigung aller gesetzlichen und tarifvertraglichen Bestimmungen.\nAuch die monatliche Erstellung und Prüfung der Kapazitäten für freie Tage der Crewmember sowie die Vertretung der Planverwaltung (Roster Maintenance) fallen in Deinen Aufgabenbereich.\nEine enge Zusammenarbeit und regelmäßige Abstimmung mit verschiedenen Schnittstellen innerhalb und außerhalb des Crewplanungs-Teams sind fester Bestandteil Deiner Tätigkeit.\nZudem kontrollierst und optimierst Du die Arbeitsvorbereitung (Pattern) und Proceedings und stellst sicher, dass die monatlichen Kapazitäten für freie Tage korrekt ermittelt werden.\nDie Teilnahme an Planprüfungen, die Durchführung von Recherchen und die Anpassung von Plänen bei Bedarf gehören ebenfalls zu Deinem Aufgabenfeld.\nDarüber hinaus unterstützt Du bei der Einarbeitung neuer Kollegen, Praktikanten, Hospitanten und Trainees.\nDurch aktive Mitarbeit in Projekten sowie mit eigenen Vorschlägen zur Optimierung von Betriebsvereinbarungen und Tarifverträgen trägst Du zur Weiterentwicklung der Dienstplangestaltung bei.\nDEIN PROFIL\nEine abgeschlossene kaufmännische Berufsausbildung oder ein betriebswirtschaftliches Studium – alternativ ein Studium im Bereich Tourismus oder Luftverkehr – bilden die Grundlage Deiner Qualifikation.\nDu hast bereits relevante Praxiserfahrung im kaufmännischen Bereich oder in einer vergleichbaren Position gesammelt.\nKomplexe Zusammenhänge werden von Dir schnell erfasst, und kreative, praxisorientierte Lösungen gehören zu Deinen Stärken.\nEine hohe Belastbarkeit und ausgeprägte Konzentrationsfähigkeit ermöglichen es Dir, auch in zeitkritischen Situationen einen kühlen Kopf zu bewahren.\nDu bist ein echter Teamplayer, der gerne kommuniziert, zuhört und Verantwortung übernimmt.\nBereitschaft zum Schichtdienst sowie sehr gute MS Office-Kenntnisse, gute verhandlungssichere Deutschkenntnisse und grundlegende Englischkenntnisse runden Dein Profil ab.\n\nHINWEIS ZUR SICHERHEITSÜBERPRÜFUNG: Sicherheit hat bei TUI oberste Priorität. Deshalb führen wir für alle Mitarbeitenden im Airline-Bereich umfassende Hintergrundprüfungen durch und informieren dich Schritt für Schritt über die erforderlichen Unterlagen.Für Bewerbungen gilt: Du musst Referenzen über die letzten fünf Jahre sowie ein Führungszeugnis aus allen Ländern vorlegen, in denen du in diesem Zeitraum über sechs Monate gelebt hast (ggf. fallen Kosten an).\n\nPlease note: For enquiries only. Applications are only accepted online.\n\nEmail: airlinecareers@tuifly.com"
}
