{
  "job_id": "spotify_data_scientist_london",
  "company": "Spotify",
  "role": "Data Scientist",
  "location": "London or Stockholm",
  "seniority": "Mid-level",
  "responsibilities": [
    "Work closely with cross-functional teams to improve product experience.",
    "Define metrics and build dashboards to improve developer experience.",
    "Perform exploratory analysis to understand how engineers interact with the internal developer platform.",
    "Communicate insights and recommendations to key partners."
  ],
  "must_have_requirements": [
    "4+ years work experience with an emphasis on programmatic data analysis, reporting, and visualization/dashboarding with Tableau or similar BI solution",
    "Ability to communicate technical information clearly and concisely.",
    "Experience applying coding skills such as Python, SQL, and/or R to analyze complex data",
    "Experience or a strong interest in internal developer platforms and tooling"
  ],
  "nice_to_have_requirements": [],
  "skills": [
    {
      "skill": "Data Analysis",
      "importance": 8
    },
    {
      "skill": "Reporting",
      "importance": 7
    },
    {
      "skill": "Visualisation",
      "importance": 7
    },
    {
      "skill": "Tableau",
      "importance": 7
    },
    {
      "skill": "Python",
      "importance": 8
    },
    {
      "skill": "SQL",
      "importance": 8
    },
    {
      "skill": "R",
      "importance": 8
    },
    {
      "skill": "Communication",
      "importance": 7
    },
    {
      "skill": "Continuous Integration",
      "importance": 5
    },
    {
      "skill": "Deployment Pipelines",
      "importance": 5
    },
    {
      "skill": "Documentation Systems",
      "importance": 4
    },
    {
      "skill": "Generative AI",
      "importance": 4
    }
  ],
  "tech_stack": [
    "Python",
    "SQL",
    "R",
    "Tableau"
  ],
  "years_of_experience_required": 4,
  "experience_summary": {
    "data_analysis": 4,
    "reporting": 4,
    "visualisation": 4
  },
  "raw_text": "Data Scientist\nPlatform Developer Experience\n\nStockholm or London\nThe Platform team creates the technology that enables Spotify to learn quickly and scale easily, enabling rapid growth in our users and our business around the globe. Spanning many disciplines, we work to make the business work; creating the frameworks, capabilities and tools needed to welcome a billion customers. Join us and help to amplify productivity, quality and innovation across Spotify.\nWe are an insights team supporting across the domains of Developer Experience, Client Platform and Core Infrastructure. As a member of the team, you’ll work closely with a cross functional team of data scientists, data engineers, user researchers, and product managers who are all passionate about crafting scalable products for our developers and customers. Your focus will be in the Developer Experience domain which strives to bring a phenomenal experience for developers at Spotify, and through this deliver intuitive, stable and reliable products for people to enjoy.\n\nWhat You'll Do\n\nWork closely with cross-functional teams of skilled engineers, data scientists, user researchers, designers, and product managers who are all passionate about providing an outstanding product experience\nDefine metrics, build dashboards and compose reports, empowering data-informed improvements to developer experience.\nPerform exploratory analysis to understand how engineers interact with our internal developer platform, how they derive value from deployment and efficiency tooling, and where we can evolve the developer experience to unlock greater efficiency and innovation.\nCommunicate insights and recommendations to key partners, helping activate data best practices\n\nWho You Are\n\nYou have a 4+ years work experience with an emphasis on programmatic data analysis, reporting, and visualization/ dashboarding with Tableau or similar BI solution\nYou are able to communicate technical information clearly and concisely, tailoring to different audiences.\nYou are curious and not afraid of exploring new domains; you enjoy partnering with others to define and develop new opportunities\nYou have shown experience applying coding skills such as Python, SQL, and/or R to analyze complex data\nYou have experience or a strong interest in internal developer platforms and tooling, with exposure to domains such as continuous integration, deployment pipelines, documentation systems, developer education, and generative AI productivity tools.\n\nWhere You'll Be\n\nThis role is based in London or Stockholm.\nWe offer you the flexibility to work where you work best! There will be some in-person meetings, but still allows for flexibility to work from home.\n\nOur global benefits\n\nExtensive learning opportunities, through our dedicated team, GreenHouse.\nFlexible share incentives letting you choose how you share in our success.\nGlobal parental leave, six months off - for all new parents.\nAll The Feels, our employee assistance program and self-care hub.\nFlexible public holidays, swap days off according to your values and beliefs."
}
