{
  "job_id": "tui_hr_systems_reporting_analyst_flexible",
  "company": "TUI",
  "role": "HR Systems & Reporting Analyst",
  "location": "Flexible",
  "seniority": "Mid-level",
  "responsibilities": [
    "Manage core HR platforms (SAP SuccessFactors) globally.",
    "Provide data solutions and technical support to teams across the organisation.",
    "Monitor and manage the HRIS support inbox and Jira-ticketing system.",
    "Partner with cross-functional teams to analyse, diagnose, and resolve HRIS issues.",
    "Create insightful reports and dashboards using SAP SuccessFactors Story Reporting.",
    "Conduct regular data audits and develop automated Python scripts.",
    "Recommend improvements to processes and systems, including the application of AI."
  ],
  "must_have_requirements": [
    "Proven experience in an HR Systems (SAP SuccessFactors) or Analyst role.",
    "Strong technical capabilities.",
    "Strong interpersonal and relationship-building skills.",
    "Advanced knowledge of MS Office applications.",
    "Experience with data visualisation tools like Tableau.",
    "Python proficiency for data manipulation, process automation, and integration into daily HR operations.",
    "Ability to manage multiple priorities and work effectively in a fast-paced environment."
  ],
  "nice_to_have_requirements": [],
  "skills": [
    {
      "skill": "SAP SuccessFactors",
      "importance": 10,
      "years_of_experience": 3
    },
    {
      "skill": "HRIS",
      "importance": 7,
      "years_of_experience": 0
    },
    {
      "skill": "Data Analysis",
      "importance": 7,
      "years_of_experience": 0
    },
    {
      "skill": "Jira",
      "importance": 5,
      "years_of_experience": 0
    },
    {
      "skill": "Python",
      "importance": 9,
      "years_of_experience": 3
    },
    {
      "skill": "MS Office",
      "importance": 7,
      "years_of_experience": 0
    },
    {
      "skill": "Tableau",
      "importance": 7,
      "years_of_experience": 0
    },
    {
      "skill": "AI",
      "importance": 5,
      "years_of_experience": 0
    },
    {
      "skill": "Interpersonal Skills",
      "importance": 7,
      "years_of_experience": 0
    },
    {
      "skill": "Relationship Building",
      "importance": 7,
      "years_of_experience": 0
    }
  ],
  "tech_stack": [
    "SAP SuccessFactors",
    "Python",
    "Tableau"
  ],
  "min_years_experience": 3,
  "max_years_experience": 0,
  "summary_experience": 3,
  "raw_text": "HR Systems & Reporting Analyst\nFlexible\nHybrid\nPermanent\nFull Time\n\nThe Group HR Systems / Data Analyst will play a crucial role in supporting TUI's global HR data strategies by managing our core HR platforms and delivering valuable insights through data analysis. This hybrid position offers an exciting opportunity to leverage your technical expertise while contributing to our HR transformation journey.\n\nABOUT OUR OFFER\n\nPersonal benefits: Attractive remuneration, discretionary bonus schemes, generous travel benefits, extensive health & well-being support, and more.\n\nFlexible working: Work is something you do, not somewhere you go. We encourage a healthy work-life balance with a dynamic working environment.\n\nA career to shape: Access the TUI Learning Hub to level-up and reach your ambitions.\n\nBroaden your network: We champion intercultural collaboration and provide opportunities to work on global projects and teams.\n\nCommunity: Get involved with incredible local charity and sustainability initiatives like the TUI Care Foundation.\n\nABOUT THE JOB\n\nYou'll serve as the subject matter expert for our Core HR platforms (SAP SuccessFactors) globally, providing data solutions and technical support to teams across the organization.\n\nWe'll rely on you to monitor and manage the HRIS support inbox and Jira-ticketing system, ensuring all inquiries are addressed promptly within our service level agreements.\n\nYou'll partner with cross-functional teams to analyze, diagnose, and resolve HRIS issues, including integration points with other systems.\n\nCreating insightful reports and dashboards using SAP SuccessFactors Story Reporting will be key to supporting HR decision-making across the business.\n\nRegular data audits and development of automated Python scripts will be part of your role to ensure consistency, accuracy, and quality of our HR data.\n\nStaying current with new HRIS trends and technologies will enable you to recommend improvements to our processes and systems, including the application of AI in auditing, reporting, and daily operations.\n\nABOUT YOU\n\nYou have proven experience in an HR Systems (SAP SuccessFactors) or Analyst role, with strong technical capabilities.\n\nStrong interpersonal and relationship-building skills allow you to work effectively at different levels of the organization.\n\nAdvanced knowledge of MS Office applications and experience with data visualization tools like Tableau are part of your skillset.\n\nPython proficiency for data manipulation, process automation, and integration into daily HR operations is essential for success in this role.\n\nThe ability to manage multiple priorities and work effectively in a fast-paced environment comes naturally to you.\n\nYour curious and data-driven personality drives you to continuously explore new ways to apply AI and advanced analytics to HR data challenges.\n\nFrom a workplace to a place to belong. At TUI we embrace diversity, equity, and inclusion, encouraging everyone to come as you are, because together, our potential is limitless.\n\nWe are committed to supporting candidates with disabilities and impairments so if you require any support, please do let us know.\n\nEmail: Laura.Firth@tui.co.uk\n\nPlease note: For enquiries only. Applications are only accepted online."
}
