{
  "job_id": "converse_associate_pont-sainte-marie",
  "company": "Converse",
  "title": "Associate (Vendeur) H/F",
  "location": "Pont-Sainte-Marie, Aube, France",
  "country": "France",
  "seniority": "Mid-level",
  "department": "Sales",
  "employment_type": "Contract",
  "experience_years_min": 1,
  "experience_years_max": 2,
  "responsibilities": [
    "Drive selling efforts and customer relationships in Converse stores.",
    "Excel in customer service and selling techniques.",
    "Support merchandising and product flow.",
    "Create a fun, energetic environment for customers.",
    "Contribute to daily sales and KPI targets.",
    "Practice great customer service through storytelling.",
    "Perform to operational and merchandising standards.",
    "Partner with teammates on tasks, processes, merchandising and product flow opportunities.",
    "Ensure basic understanding of footwear, apparel and accessories.",
    "Support superior standards around store cleanliness and store safety.",
    "Act in accordance with store policies and procedures at all times.",
    "Work flexible hours, evenings, weekends and holidays as needed."
  ],
  "must_have_requirements": [
    "1-2 years of retail experience",
    "Ability to perform all retail floor functions including standing for extended periods, climb ladders, stock/retrieve/ merchandise, and unload shipments",
    "Ability to communicate (written and verbal) clearly with employees and customers",
    "Perform basic retail math and have basic computer skills."
  ],
  "nice_to_have_requirements": [],
  "skills": [
    {
      "name": "Customer Service",
      "importance": 9
    },
    {
      "name": "Sales",
      "importance": 9
    },
    {
      "name": "Merchandising",
      "importance": 7
    },
    {
      "name": "Communication (written and verbal)",
      "importance": 8
    },
    {
      "name": "Retail Mathematics",
      "importance": 6
    },
    {
      "name": "Computer Skills",
      "importance": 5
    }
  ],
  "tech_stack": [],
  "min_years_experience": 1,
  "max_years_experience": 2,
  "raw_text": "Associate (Vendeur) H/F - CDI 24 heures/semaine\n1 McArthurGlen Troyes, Pont-Sainte-Marie, Aube 95310, France\n\nJob Description\n\nConverse is the story of a sneaker that started on the court and moved to the stage and street. We’re a company ready for change and that’s who we hire: the most malleable, the most innovative, and the most creative. Our clothes and sneakers have been worn by rebels, rockers, rappers, artists, thinkers, and individuals. So that’s why we hire individuals. So we’re speaking the same language.\nWithout you, we’d just be collectors of our own stuff.\n\nBusiness equals selling stuff. That’s the basic model. The more complex awesome model is creating stuff that people identify with and then you figuring out how to get it to them. We need people like you: creative, dynamic problem solvers who see it as more than business. Who see it as giving people the tools of self-expression and individuality.\n\n\nAs a Sales Associate you will be responsible for driving the selling efforts and customer relationships in Converse stores through excelling in customer service and selling techniques, while supporting merchandising and product flow.\n \n\nCreate a fun, energetic environment for our customer.\n\nKnowledge of and contribution to daily sales and KPI targets\n\nConsistently practice great customer service through storytelling\n\nConsistently perform to operational and merchandising standards\n\nPartner with teammates on tasks, processes, merchandising and product flow opportunities\n\nEnsure basic understanding of footwear, apparel and accessories\n\nSupport superior standards around store cleanliness and store safety\n\nActs in accordance with store policies and procedures at all times.\n\nAbility to work flexible hours, evenings, weekends and holidays as needed\n\nQualifications\n\n1-2 years of retail experience\n\nMust be able to perform all retail floor functions including standing for extended periods, climb ladders, stock/retrieve/ merchandise, and unload shipments\n\nMust be able to communicate (written and verbal) clearly with employees and customers\n\nMust perform basic retail math and have basic computer skills."
}
