{
  "job_id": "tui_product_cruises_rijswijk",
  "company": "TUI",
  "role": "Product Cruises",
  "location": "Rijswijk, Netherlands",
  "remote_policy": "Hybrid",
  "contract_type": "Internship",
  "work_type": "Full Time",
  "hours_per_week": 40,
  "seniority": "Junior",
  "responsibilities": [
    "Write texts and elaborate itineraries for the website and brochures.",
    "Create 360-webpages with ship and shipping company information.",
    "Conduct current price comparisons and competitor analyses.",
    "Make adjustments to travel documents and the website.",
    "Responsible for processing and updating daily prices.",
    "Contribute to operational activities related to booking and departing customers.",
    "Process and manage bookings on allotment (stock).",
    "Request and supplement image and video material from shipping companies.",
    "Point of contact for various departments within TUI and external organisations."
  ],
  "must_have_requirements": [
    "Enrolled in MBO 4 or HBO education focused on tourism.",
    "Good knowledge of the Dutch and English language in word and writing.",
    "Creative, accurate and proactive.",
    "Good at setting priorities."
  ],
  "nice_to_have_requirements": [],
  "skills": [
    {
      "skill": "Dutch Language",
      "importance": 7,
      "years_of_experience": 0
    },
    {
      "skill": "English Language",
      "importance": 7,
      "years_of_experience": 0
    },
    {
      "skill": "Tourism",
      "importance": 7,
      "years_of_experience": 0
    },
    {
      "skill": "Creativity",
      "importance": 7,
      "years_of_experience": 0
    },
    {
      "skill": "Prioritisation",
      "importance": 7,
      "years_of_experience": 0
    }
  ],
  "tech_stack": [],
  "min_years_experience": 0,
  "max_years_experience": 0,
  "raw_text": "Stage Product Cruises\nRijswijk, Netherlands\nHybrid\nInternship\nFull Time\n40\n\nWil jij elke dag een ander uitzicht zonder je koffer opnieuw in te pakken? Sluit je aan bij ons Product Management Cruises team bij TUI! Wij zijn verantwoordelijk voor de inkoop en presentatie van zee- en riviercruises en het ontwikkelen van aantrekkelijke pakketreizen. We zoeken een enthousiaste stagiair vanaf februari 2026. Ben jij goed in het creatief schrijven van content, het maken van informatieve webpagina’s en het up-to-date houden van verkoopprijzen? Dan is deze dynamische en veelzijdige stage iets voor jou. Grijp deze kans en werk mee aan ons prachtige product!\n\nOver ons aanbod\n\nJe krijgt volop kansen om je vaardigheden te verbeteren via trainingen\nMet begeleiding van ervaren collega’s doe je nieuwe kennis op\nJe werkt in een dynamische omgeving waar het nooit saai is. Je ontmoet mensen van verschillende afdelingen, wat je netwerk vergroot\nNa hard werken kun je ontspannen tijdens borrels en activiteiten\nDe stage biedt toekomstperspectief en kan een springplank zijn naar een baan binnen het bedrijf, waar jouw ontwikkeling centraal staat\n\n\nOver de functie\n\nSchrijven van teksten en uitwerken van vaarroutes voor de website en brochures\nHet creëren van 360-webpagina’s met scheeps- en rederij-informatie\nActuele prijsvergelijkingen en concurrentieanalyses doen\nAanpassingen uitvoeren voor reisdocumenten en de website\nVerantwoordelijk voor het verwerken en updaten van dagprijzen\nBijdrage leveren aan operationele werkzaamheden met betrekking tot boekende en vertrekkende klanten\nHet verwerken en beheren van boekingen op allotment (voorraad)\nHet opvragen en aanvullen van beeld- en videomateriaal bij rederijen\nAanspreekpunt voor diverse afdelingen binnen TUI en externe organisaties\n\n\nOver jou\nEr zijn meerdere manieren waarop je een match kan zijn voor deze functie – hier zijn een aantal zaken die wij zoeken:\n• Je volgt een MBO 4 of HBO opleiding gericht op toerisme\n• Je hebt goede kennis van de Nederlandse én Engelse taal in woord en geschrift\n• Je bent creatief, nauwkeurig en proactief\n• Je bent goed in staat om prioriteiten te bepalen"
}
