{
  "id": "spotify_sales_trainer_london",
  "raw_text": "Sales Trainer\nEMEA - London\n\nSell what you love. For us and millions of users across the globe, that’s Spotify. Join the Sales team and you’ll build the relationships that help grow our business in existing markets and beyond. We don’t just sell creative solutions to our clients and partners, we help to shape them; using our expert knowledge of ad products, sales channels and the industry to impact the way the world experiences music and podcasts. \nOur Ad Sales Training & Enablement team empowers Spotify’s global Sales organisation to be the best in the industry. We create, deliver, and optimise learning programs that help our sellers and sales support teams stay sharp, confident, and customer-centric. Working closely with Product Marketing, Business Marketing, and Sales Leadership, we design experiences that drive performance and help our teams grow with Spotify’s rapidly evolving advertising business.\n\nWhat You'll Do\n\nPartner with sales leaders to define and execute the training strategy for our EMEA sales teams.\nDeliver engaging onboarding sessions for new hires, both virtually and in person.\nCollaborate with Product and Business Marketing to train teams on new ad products and positioning.\nDesign and facilitate dynamic sales skills workshops for sales and support teams.\nConduct needs assessments, create learning materials, and deliver engaging content \nProvide personalized coaching to sales staff to help elevate their impact.\nEvaluate the effectiveness of programs and continuously improve based on feedback and results.\n\nWho You Are\n\nYou’re an experienced sales trainer (2+ years) with a passion for helping people perform at their best.\nYou know the digital media landscape and understand programmatic advertising and/or social platforms .\nYou’re an engaging facilitator who adapts your style to different learners.\nYou’ve built and delivered end-to-end training programs — from needs assessment to facilitation.\nYou’re skilled at building trusted relationships with learners, managers, and cross functional stakeholders.\nYou’re confident in giving clear, constructive feedback and thrive in a collaborative environment.\nYou’re highly organized and comfortable managing multiple projects across regions.\nExperience in sales or media buying is a plus.\nYou’re fluent in English; additional European languages are a strong advantage.\n\nWhere You'll Be\n\nThis role is based in London.\n We offer you the flexibility to work where you work best! There will be some in-person meetings, but it still allows flexibility to work from home.\nLearn more about working from anywhere at Spotify.",
  "title": "Sales Trainer",
  "company": "Spotify",
  "location": "London",
  "country": "UK",
  "seniority": "Mid-level",
  "responsibilities": [
    "Partner with sales leaders to define and execute training strategy for EMEA sales teams.",
    "Deliver engaging onboarding sessions for new hires, virtually and in person.",
    "Collaborate with Product and Business Marketing to train teams on new ad products and positioning.",
    "Design and facilitate dynamic sales skills workshops for sales and support teams.",
    "Conduct needs assessments, create learning materials, and deliver engaging content.",
    "Provide personalised coaching to sales staff to help elevate their impact.",
    "Evaluate the effectiveness of programs and continuously improve based on feedback and results."
  ],
  "must_have_requirements": [
    "Experienced sales trainer (2+ years).",
    "Knowledge of the digital media landscape and understanding of programmatic advertising and/or social platforms.",
    "Engaging facilitator who adapts style to different learners.",
    "Experience building and delivering end-to-end training programs.",
    "Skilled at building trusted relationships with learners, managers, and cross-functional stakeholders.",
    "Confident in giving clear, constructive feedback.",
    "Highly organised and comfortable managing multiple projects across regions.",
    "Fluent in English."
  ],
  "nice_to_have_requirements": [
    "Experience in sales or media buying.",
    "Additional European languages."
  ],
  "skills": [
    {
      "name": "Sales Training",
      "importance": 10,
      "years_of_experience": 2
    },
    {
      "name": "Digital Media",
      "importance": 7,
      "years_of_experience": 0
    },
    {
      "name": "Programmatic Advertising",
      "importance": 7,
      "years_of_experience": 0
    },
    {
      "name": "Social Platforms",
      "importance": 7,
      "years_of_experience": 0
    },
    {
      "name": "Facilitation",
      "importance": 8,
      "years_of_experience": 0
    },
    {
      "name": "Stakeholder Management",
      "importance": 7,
      "years_of_experience": 0
    },
    {
      "name": "Communication",
      "importance": 7,
      "years_of_experience": 0
    },
    {
      "name": "Project Management",
      "importance": 6,
      "years_of_experience": 0
    },
    {
      "name": "English",
      "importance": 10,
      "years_of_experience": 0
    },
    {
      "name": "Sales",
      "importance": 4,
      "years_of_experience": 0
    },
    {
      "name": "Media Buying",
      "importance": 4,
      "years_of_experience": 0
    },
    {
      "name": "European Languages",
      "importance": 4,
      "years_of_experience": 0
    }
  ],
  "tech_stack": [],
  "experience_min": 2,
  "experience_max": 0,
  "years_of_experience": 2
}
