{
  "id": "tui_retail_assistant_manager_eastwood",
  "title": "Retail Assistant Manager",
  "location": "Eastwood, United Kingdom",
  "company": "TUI",
  "seniority": "Mid-level",
  "department": "Retail Team",
  "employment_type": "Permanent",
  "work_schedule": "Part Time",
  "salary_min": 0,
  "salary_max": 0,
  "currency": "GBP",
  "responsibilities": [
    "Lead, inspire, coach and develop a team to become destination experts.",
    "Recommend and sell holidays, Cruise, UK Breaks and additional products.",
    "Deliver exceptional sales and customer service.",
    "Put all customers at the heart of the business by creating unforgettable holiday experiences.",
    "Lead by example and role model company values to inspire the team.",
    "Guide, coach and develop the team to collaboratively reach high performance and standards.",
    "Proactively investigate and resolve customer questions or complaints.",
    "Take ownership when things don’t go quite right.",
    "Work with a variety of systems to enhance knowledge and improve the customer digital journey.",
    "Monitor and report on customer feedback, spot trends, and improve customer satisfaction and loyalty.",
    "Assist with recruiting talent and maintaining high levels of engagement and low levels of attrition."
  ],
  "qualifications_must_have": [
    "Proven passion for leading by example and delivering excellent customer service.",
    "Confident and fun motivator with a strong drive to achieve goals and sales targets.",
    "Skilled at balancing multiple tasks and confident to stay motivated when challenges arise.",
    "Flexible to embrace change and adapt easily to new ways of working.",
    "Trusted mentor with a fair and inclusive management style.",
    "Organised individual who takes pride in their work and able to communicate effectively.",
    "Able to work a varied shift pattern each week in-line with shop opening and closing times."
  ],
  "qualifications_nice_to_have": [],
  "skills": [
    {
      "name": "Customer Service",
      "importance": 10,
      "years_of_experience": 0
    },
    {
      "name": "Sales",
      "importance": 8,
      "years_of_experience": 0
    },
    {
      "name": "Leadership",
      "importance": 9,
      "years_of_experience": 0
    },
    {
      "name": "Coaching",
      "importance": 7,
      "years_of_experience": 0
    },
    {
      "name": "Team Development",
      "importance": 7,
      "years_of_experience": 0
    },
    {
      "name": "Communication",
      "importance": 8,
      "years_of_experience": 0
    },
    {
      "name": "Problem Solving",
      "importance": 7,
      "years_of_experience": 0
    },
    {
      "name": "Motivation",
      "importance": 8,
      "years_of_experience": 0
    },
    {
      "name": "Adaptability",
      "importance": 7,
      "years_of_experience": 0
    },
    {
      "name": "Mentoring",
      "importance": 6,
      "years_of_experience": 0
    },
    {
      "name": "Organisation",
      "importance": 7,
      "years_of_experience": 0
    }
  ],
  "tech_stack": [],
  "experience_min": 0,
  "experience_max": 0,
  "years_of_experience": 0,
  "raw_text": "Retail Assistant Manager\nEastwood, United Kingdom\nOnsite\nPermanent\nPart Time\n30\n\nHere at TUI, you’ll find we’re an inclusive company with a culture of care and by joining the Retail Team as an Assistant Manager in our Eastwood store, you’ll work alongside your manager to lead, inspire, coach and develop a team to become destination experts to recommend and sell holidays, Cruise, UK Breaks and additional products whilst delivering exceptional sales and customer service. You’ll put all customers at the heart of our business by creating unforgettable holiday experiences that make us the best-loved holiday company.\n\nAs part of our dedication to delivering exceptional customer service and flexibility for our customers, you’ll enjoy a varied shift pattern each week including weekends and bank holidays, and evenings at some of our busier stores.\n\nABOUT OUR OFFER\n\nTUI offers much more than just a starting salary of £13.30 per hour\nBe rewarded for exceeding your targets with our commission scheme\nEnjoy fantastic holiday benefits, discounts, special offers and the ability to purchase additional TUI time off\nBenefit from our Health and Wellbeing across key areas – Financial, Health, Social, Community and Career\nInvestment in your development and career progression\nPension scheme and life assurance.\n\nABOUT THE JOB\n\nLead by example and role model company values to inspire your team and deliver excellent customer service\nPersonality and experience will assist you to guide, coach and develop the team to collaboratively reach high performance and standards that drive engagement\nAssist with developing the team to be proactive and actively investigate and resolve every question or complaint.  If things don’t go quite right, you’ll have the confidence to step in and take ownership\nAs technology advances so does TUI, you’ll work with a variety of systems empowering you to enhance your knowledge to actively improve our customer digital journey\nMonitor and report on customer feedback, spot trends, improve customer satisfaction and loyalty to grow our business\nAssist with recruiting talent, maintaining high levels of engagement and low levels of attrition. \n\nABOUT YOU\n\nProven passion for leading by example and delivering excellent customer service\nConfident and fun motivator with a strong drive to achieve goals and sales targets\nSkilled at balancing multiple tasks and confident to stay motivated when challenges arise\nFlexible to embrace change and adapt easily to new ways of working\nTrusted mentor with a fair and inclusive management style who recognises people are our most valued asset\nAn organised individual who takes pride in their work and able to communicate effectively\nAble to work a varied shift pattern each week in-line with shop opening and closing times.\n\nEmail: retail.careers@tui.co.uk\n\nPlease note: For enquiries only. Applications are only accepted online."
}
