{
  "id": "tui_travel_advisor_tallaght",
  "title": "Retail Travel Advisor",
  "company": "TUI",
  "location": "Tallaght, Ireland",
  "seniority": null,
  "responsibilities": [
    "Recommend and sell holidays, cruises, UK breaks and additional products.",
    "Create unforgettable holiday experiences.",
    "Deliver exceptional customer service.",
    "Investigate and resolve customer questions or complaints.",
    "Achieve sales objectives.",
    "Embrace change and adapt to new ways of working.",
    "Prioritise multiple tasks in a fast-paced environment.",
    "Collaborate with customers and colleagues."
  ],
  "must_have_requirements": [
    "Excellent customer service skills.",
    "Strong dedication to achieve goals and sales targets.",
    "Able to prioritise multiple tasks in a fast-paced environment.",
    "Ability to embrace change and adapt to new ways of working.",
    "Team player.",
    "Organised individual.",
    "Able to work a varied shift pattern."
  ],
  "nice_to_have_requirements": [],
  "skills": [
    {
      "name": "Customer Service",
      "importance": 9,
      "years_of_experience": 0
    },
    {
      "name": "Sales",
      "importance": 8,
      "years_of_experience": 0
    },
    {
      "name": "Communication",
      "importance": 7,
      "years_of_experience": 0
    },
    {
      "name": "Problem Solving",
      "importance": 7,
      "years_of_experience": 0
    },
    {
      "name": "Adaptability",
      "importance": 7,
      "years_of_experience": 0
    },
    {
      "name": "Teamwork",
      "importance": 7,
      "years_of_experience": 0
    },
    {
      "name": "Organisation",
      "importance": 7,
      "years_of_experience": 0
    }
  ],
  "tech_stack": [],
  "min_years_experience": 0,
  "max_years_experience": 0,
  "summary_experience": {
    "customer_service": 0,
    "sales": 0,
    "communication": 0,
    "problem_solving": 0,
    "adaptability": 0,
    "teamwork": 0,
    "organisation": 0
  },
  "raw_text": "RETAIL TRAVEL ADVISOR\n\nTallaght, Ireland\nOnsite\nPermanent\nPart Time\n30\n\nHere at TUI, you’ll find we’re an inclusive company with a culture of care and by joining the Retail Team as a Part Time Travel Advisor in our Tallaght Dublin store, we’ll support you to become a destination expert so that you can recommend and sell holidays, Cruise, UK Breaks and additional products. You’ll put all customers at the heart of our business by creating unforgettable holiday experiences that make us the best-loved holiday company.\n\nAs part of our dedication to delivering exceptional customer service and flexibility for our customers, you’ll enjoy a varied shift pattern of around 30 hours each week including weekends and bank holidays, and evenings at some of our busier stores.\n\nABOUT OUR OFFER\n\nTUI offers much more than just a starting salary of 14.86 euros per hour\nBe rewarded for exceeding your targets with our commission scheme\nEnjoy fantastic holiday benefits, discounts, special offers and the ability to purchase additional TUI time off\nBenefit from our Health and Wellbeing across key areas – Financial, Health, Social, Community and Career\nInvestment in your development and career progression\nPension scheme and life assurance\n\nABOUT THE JOB\n\nUse your passion to inspire our customers and colleagues whilst enjoying a great amount of fun\nYour drive to achieve will lead you to exceed your sales objectives, in Retail we call it ‘Smashing your Targets’\nYou’ll embrace change and rise to the challenges of a customer engaged role both face to face and virtually\nIf things don’t go to plan, you’ll need to be confident to actively investigate and resolve any question or complaint\nAs technology advances so does TUI, you’ll receive training on a variety of systems empowering you to enhance your knowledge whilst bringing memorable holidays to life for our customers.\n\nABOUT YOU\n\nExcellent customer service skills with a genuine passion to go above and beyond\nA strong dedication to achieve goals and sales targets\nAble to prioritise multiple tasks in a fast-paced environment and bounce back from challenges\nAbility to embrace change and\tadapt to new ways of working\nA team player who engages and collaborates with our customers and colleagues\nAn organised individual who takes pride in their work and communicates effectively\nAble to work a varied shift pattern each week in-line with shop opening and closing times.\n\nTo apply for this role, part of the application process will require you to complete an online assessment, you'll recieve an email to complete this once your application has been submitted.\n\nQuestions about the job?\n\nI'm happy to answer them.\nEmail: retail.careers@tui.co.uk\n\nPlease note: For enquiries only. Applications are only accepted online."
}
